Repository: digitalearthafrica/deafrica-docs
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Notice we could have a small cosine distance but a large Euclidean distance; for example, if the angle between the vectors is small, but one is much longer than the other. This is an important property of cosine distance (and thus SMAD) — unlike Euclidean distance, cosine distance is not skewed by the magnitude of the measurements.
fr: Remarquez que nous pouvons avoir une petite distance cosinus mais une grande distance euclidienne ; par exemple, si l'angle entre les vecteurs est petit, mais que l'un est beaucoup plus long que l'autre. Il s'agit d'une propriété importante de la distance cosinus (et donc de SMAD) - contrairement à la distance euclidienne, la distance cosinus n'est pas biaisée par la magnitude des mesures.

source: Cosine distance is defined more formally as:
fr: La distance cosinus est définie plus formellement comme suit :

source: :nbsphinx-math:`\begin{align*} \text{Cosine distance (two dimensions)} = 1 - \frac{x_1 y_1 + x_2 y_2}{ \left( \sqrt{ \left( x_1\right) ^2 + \left( x_2\right) ^2 } \right) \left( \sqrt{ \left( y_1\right) ^2 + \left( y_2\right) ^2 } \right)} \end{align*}`
fr: :nbsphinx-math:``begin{align*} \text{Distance cosinus (deux dimensions)} = 1 - \frac{x_1 y_1 + x_2 y_2}{ \left( \sqrt{ \left( x_1\right) ^2 + \left( x_2\right) ^2 } \right)} \left( \sqrt{ \left( y_1\right) ^2 + \left( y_2\right) ^2 } \right)} \end{align*}`

source: For more than two dimensions, we can generalise the cosine distance formula for a single pixel. For a multispectral measurement of :math:`p` bands at timestep :math:`t`, :math:`\mathbf{x}^{(t)}`, and the geomedian at the same point :math:`\mathbf{m}`, the cosine distance is:
fr: Pour plus de deux dimensions, nous pouvons généraliser la formule de la distance cosinus pour un seul pixel. Pour une mesure multispectrale de :math:`p` bandes au pas de temps :math:`t`, :math:`\mathbf{x}^{(t)}`, et le géomédien au même point :math:`\mathbf{m}`, la distance cosinus est :

source: :nbsphinx-math:`\begin{align*}\small &\text{Multispectral cosdist}\left( \mathbf{x}^{(t)}, m \right) \text{ for timestep } t \\ &= 1 - \frac{ \mathbf{x}^{(t)} \cdot \mathbf{m} }{ \lVert \mathbf{x}^{(t)} \rVert \ \lVert \mathbf{m} \rVert} \ \text{ for } \mathbf{x}^{(t)}, \mathbf{m} \in \mathbb{R}_{p}\\ &= 1 - \left( \frac{\left( x_{\text{band 1}}^{(t)} \right) \left(m_{\text{band 1}} \right) + \left( x_{\text{band 2}}^{(t)} \right) \left(m_{\text{band 2}} \right) + \cdots + \left( x_{\text{band p}}^{(t)} \right) \left(m_{\text{band p}} \right)}{ \left(\sqrt{\left( x_{\text{band 1}}^{(t)} \right)^2 + \cdots+ \left( x_{\text{band p}}^{(t)} \right)^2} \right) \left( \sqrt{\left( m_{\text{band 1}} \right)^2 + \cdots+ \left( m_{\text{band p}} \right)^2 } \right)} \right) \end{align*}`
fr: :nbsphinx-math:``begin{align*}\small &\text{Costdist multispectral}\left( \mathbf{x}^{(t)}, m \right) \text{ for timetep } t \\\\\\\= 1 - \frac{ \mathbf{x}^{(t)} \cdot \mathbf{m} }{ \lVert \mathbf{x}^{(t)} \rVert \N- \NVert \Nmathbf{m} \rVert} \\N- \N- texte{ pour } \mathbf{x}^{(t)}, \mathbf{m} \in \mathbb{R}_{p}\ &= 1 - \left( \frac{\left( x_{\text{band 1}}^{(t)} \right) \left(m_{\text{{1}} \right) + \left( x_{\text{2}}^{(t)} \right) \left(m_{\text{band 2}} \right) + \cdots + \left( x_{\text{band p}}^{(t)} \right) \left(m_{\text{band p}} \right)}{ \left(\sqrt{\left( x_{\text{band 1}}^{(t)} \right)^2 + \cdots+ \left( x_{\text{band p}}^{(t)} \right)^2} \right) \left( \sqrt{\left( m_{\text{band 1} \right)^2 + \cdots+ \left( m_{\text{band p}} \right)^2 } \right)} \end{align*}`

source: Then for :math:`N` timesteps, SMAD is the median of the cosine distances.
fr: Ensuite, pour :math:`N` pas de temps, SMAD est la médiane des distances en cosinus.

source: :nbsphinx-math:`\begin{align*} \text{SMAD} = \text{median} \left( \left\{ \text{cosdist}\left( \mathbf{x}^{(t)}, \mathbf{m} \right), t = 1, \dots , N \right\} \right) \end{align*}`
fr: :nbsphinx-math:``begin{align*} \text{SMAD} = \text{médiane} \left( \left\{cosdist}\left( \mathbf{x}^{(t)}, \mathbf{m} \right), t = 1, \dots , N \right\} \right) \end{align*}`

source: As with the other distances and dissimilarities used in the MADs, this results in a positive scalar value, thus SMAD is a positive scalar. Valid values for SMAD fall between ``0`` – ``1``.
fr: Comme pour les autres distances et dissimilarités utilisées dans les MAD, il en résulte une valeur scalaire positive, donc SMAD est un scalaire positif. Les valeurs valides pour SMAD sont comprises entre ``0`` et ``1``.

source: In applications of Earth observation data, SMAD is useful for showing areas of land cover change. One reason is that SMAD is less affected by cloud; unlike EMAD, it is invariant to albedo changes, such as that caused by the diffusion of solar radiation. SMAD can also be used to track water bodies, as water has high variation in reflectance.
fr: Dans les applications des données d'observation de la Terre, la SMAD est utile pour montrer les zones de changement de la couverture terrestre. L'une des raisons est que le SMAD est moins affecté par les nuages ; contrairement à l'EMAD, il est invariant aux changements d'albédo, tels que ceux causés par la diffusion du rayonnement solaire. Le SMAD peut également être utilisé pour suivre les plans d'eau, car la réflectance de l'eau varie fortement.

source: Bray-Curtis MAD (BCMAD)
fr: MAD de Bray-Curtis (BCMAD)

source: The Bray-Curtis MAD (BCMAD) is calculated from the Bray-Curtis dissimilarity. The Bray-Curtis dissimilarity emphasises differences in each band between the measurement and the geomedian.
fr: La MAD de Bray-Curtis (BCMAD) est calculée à partir de la dissimilarité de Bray-Curtis. La dissimilarité de Bray-Curtis met en évidence les différences dans chaque bande entre la mesure et le géomédien.

source: For a single band of satellite data, the Bray-Curtis dissimilarity looks remarkably like a normalised band index. For example, if we only had red band data, it might look something like this:
fr: Pour une seule bande de données satellite, la dissimilarité de Bray-Curtis ressemble remarquablement à un indice de bande normalisé. Par exemple, si nous n'avions que des données de la bande rouge, cela pourrait ressembler à ceci :

source: :nbsphinx-math:`\begin{align*} \text{Single-band Bray-Curtis dissimilarity at timestep }t = \frac{\left| x_{\text{red}}^{(t)} - m_{\text{red}}\right|}{ \left| x_{\text{red}}^{(t)} + m_{\text{red}} \right| } \end{align*}`
fr: :nbsphinx-math:`\begin{align*} \text{Dissimilarité de Bray-Curtis monobande au pas de temps }t = \frac{\left| x_{\text{red}}^{(t)} - m_{{text{red}}\right|}{ \left| x_{\text{red}}^{(t)} + m_{{text{red}} \right| } \end{align*}`

source: It can be generalised to a multispectral dataset with :math:`p` bands:
fr: Il peut être généralisé à un ensemble de données multispectrales avec des bandes :math:`p` :

source: :nbsphinx-math:`\begin{align*} &\text{Multispectral Bray-Curtis dissimilarity for timestep }t\\ &= \frac{\left| x_{\text{band 1}}^{(t)} - m_{\text{band 1}}\right| + \left| x_{\text{band 2}}^{(t)} - m_{\text{band 2}} \right| + \dots + \left| x_{\text{band p}}^{(t)} - m_{\text{band p}} \right| }{ \left| x_{\text{band 1}}^{(t)} + m_{\text{band 1}} \right| + \left| x_{\text{band 2}}^{(t)} + m_{\text{band 2}} \right| + \dots + \left| x_{\text{band p}}^{(t)} + m_{\text{band p}} \right|} \end{align*}`
fr: :nbsphinx-math:`\begin{align*} &\text{Dissimilarité multispectrale de Bray-Curtis pour le pas de temps }t\\\= \frac{\left| x_{\text{band 1}}^{(t)} - m_{\text{\band{\}}\right| + \left| x_{\text{\band 2}}^{(t)} - m_{\text{\}{\i1}de la bande 2}} \right| + \dots + \left| x_{\text{\band p}}^{(t)} - m_{\text{\c} de la bande p}} \right| }{ \left| x_{\text{\}band 1}}^{(t)} + m_{\text{\text{\}} de la bande 1} \right| + \left| x_{\text{\band 2}}^{(t)} + m_{\text{\}{\i1}de la bande 2}} \right| + \dots + \left| x_{\text{band p}}^{(t)} + m_{\text{\}band p}} \right|} \end{align*}`

source: The Bray-Curtis dissimilarity will be maximised at a value of ``1`` when the measurements in each band are completely different. Conversely, the value of the dissimilarity will be small where each band observation is similar to the geomedian of that band.
fr: La dissimilarité de Bray-Curtis sera maximisée à une valeur de ``1`` lorsque les mesures dans chaque bande sont complètement différentes. Inversement, la valeur de la dissimilarité sera faible lorsque l'observation de chaque bande est similaire au géomédien de cette bande.

source: As with the other MADs, the BCMAD is found by taking the median of all the Bray-Curtis dissimilarities from :math:`N` timesteps. For GeoMAD, :math:`p=10`.
fr: Comme pour les autres MAD, le BCMAD est trouvé en prenant la médiane de toutes les dissimilarités de Bray-Curtis de :math:`N` pas de temps. Pour GeoMAD, :math:`p=10`.

source: BCMAD takes on values from ``0 - 1``.
fr: BCMAD prend les valeurs de ``0 - 1``.

source: Appendix
fr: Annexe

source: Example: calculating Euclidean distance
fr: Exemple : calcul de la distance euclidienne

source: Let’s take a selection of bands from one pixel, from one timestep. For that pixel, we have both the measurements taken by the single satellite flyover, and the geomedian value.
fr: Prenons une sélection de bandes d'un pixel, d'un pas de temps. Pour ce pixel, nous avons à la fois les mesures prises par le survol du satellite et la valeur géomédienne.

source: **Table A.1: Example multispectral data — one timestep, four bands**
fr: **Tableau A.1 : Exemple de données multispectrales - un pas de temps, quatre bandes**.

source: Band
fr: Bande

source: Surface reflectance measurement :math:`x^{(t)}`
fr: Mesure de la réflectance de la surface :math:`x^{(t)}`

source: Surface reflectance geomedian :math:`m`
fr: Réflexion de la surface géomédienne :math:`m`

source: Blue
fr: Bleu

source: Green
fr: Vert

source: Red
fr: Rouge

source: Near Infrared (NIR) 1
fr: Infrarouge proche (NIR) 1

source: Then the Euclidean distance for this pixel at this timestep, :math:`t`, is:
fr: La distance euclidienne pour ce pixel à ce moment, :math:`t`, est alors :

source: :nbsphinx-math:`\begin{align*} &\text{Euclidean distance} \\ \tiny &= \sqrt{\left( x^{(t)}_{\text{band 1}} - m_{\text{band 1}} \right)^2 + \left( x^{(t)}_{\text{band 2}} - m_{\text{band 2}} \right)^2 + \dots + \left( x^{(t)}_{\text{band p}} - m_{\text{band p}} \right)^2 }\\ &= \sqrt{\left( x^{(t)}_{\text{red}} - m_{\text{red}} \right)^2 + \left( x^{(t)}_{\text{green}} - m_{\text{green}} \right)^2 + \left( x^{(t)}_{\text{blue}} - m_{\text{blue}} \right)^2 + \left( x^{(t)}_{\text{nir1}} - m_{\text{nir1}} \right)^2}\\ &= \sqrt{\left( 2176 - 2032 \right)^2 + \left( 1468 - 1406 \right)^2 + \left(1028 - 969 \right)^2 + \left( 3090 - 3078 \right)^2}\\ &= 167.9 \end{align*}`
fr: :nbsphinx-math:``begin{align*} &\text{Distance euclidienne} \\N-iny &= \sqrt{\N-ft( x^{(t)}_{\text{{band 1}}) - m_{\text{\bande 1}} \right)^2 + \left( x^{(t)}_{\text{band{ 2}} - m_{\text{\}{\i1}bande 2}} \right)^2 + \dots + \left( x^{(t)}_{\text{band p}} - m_{\text{\c} p}} \right)^2 }\\\\\N &= \sqrt{\left( x^{(t)}_{\text{red}} m_{\text{red}} - m_{\text{rouge}} \right)^2 + \left( x^{(t)}_{\text{\}} vert}) - m_{\text{\} vert} \Droit)^2 + \Ngauche( x^{(t)}_{\text{\} bleu}}) - m_{\text{\c} bleu}} \right)^2 + \left( x^{(t)}_{\text{{nir1}} - m_{\text{\nir1}} \\N- droite)^2}\\\N &= \sqrt{\La gauche( 2176 - 2032 \N- droite)^2 + \N- gauche( 1468 - 1406 \N- droite)^2 + \N- gauche(1028 - 969 \N- droite)^2 + \N- gauche( 3090 - 3078 \N- droite)^2}\N &= 167.9 \N- fin{align*}`

source: To then find the EMAD of this dataset, the calculation for Euclidean distance would first need to be repeated for all the other timesteps (not provided in the example data).
fr: Pour trouver l'EMAD de cet ensemble de données, il faudrait d'abord répéter le calcul de la distance euclidienne pour tous les autres pas de temps (non fournis dans l'exemple de données).

source: Example: calculating cosine distance
fr: Exemple : calcul de la distance en cosinus

source: Using the example multispectral data from Table A.1, we can manually calculate the value of cosine distance for timestep :math:`t`.
fr: En utilisant l'exemple de données multispectrales du tableau A.1, nous pouvons calculer manuellement la valeur de la distance cosinus pour le pas de temps :math:`t`.

source: :nbsphinx-math:`\begin{align*} &\text{Cosine distance} \\ &= 1 - \left( \frac{\left( x_{\text{band 1}}^{(t)} \right) \left(m_{\text{band 1}} \right) + \left( x_{\text{band 2}}^{(t)} \right) \left(m_{\text{band 2}} \right) + \cdots + \left( x_{\text{band p}}^{(t)} \right) \left(m_{\text{band p}} \right)}{ \left(\sqrt{\left( x_{\text{band 1}}^{(t)} \right)^2 + \cdots+ \left( x_{\text{band p}}^{(t)} \right)^2} \right) \left( \sqrt{\left( m_{\text{band 1}} \right)^2 + \cdots+ \left( m_{\text{band p}} \right)^2 } \right)} \right) \\ &= 1 -\\ & \ \frac{\left( x_{\text{blue}}^{(t)} \right) \left(m_{\text{blue}} \right) + \left( x_{\text{green}}^{(t)} \right) \left(m_{\text{green}} \right) + \left( x_{\text{red}}^{(t)} \right) \left(m_{\text{red}} \right) + \left( x_{\text{nir1}}^{(t)} \right) \left(m_{\text{nir1}} \right)}{\sqrt{\left( x_{\text{blue}}^{(t)} \right)^2 + \left( x_{\text{green}}^{(t)} \right)^2 + \left( x_{\text{red}}^{(t)} \right)^2+ \left( x_{\text{nir1}}^{(t)} \right)^2}\sqrt{\left( m_{\text{blue}} \right)^2 + \left( m_{\text{green}} \right)^2 + \left( m_{\text{red}} \right)^2 + \left(m_{\text{nir1}}\right)^2 } }\\ &= 1 -\\ & \ \frac{\left( 1028 \right) \left(969 \right) + \left(1468 \right) \left(1406 \right) + \left(2176 \right) \left(2032\right) + \left( 3090 \right) \left(3078\right)}{\sqrt{\left( 1028 \right)^2 + \left( 1468\right)^2 + \left( 2176 \right)^2+ \left(3090\right)^2} \sqrt{\left( 969 \right)^2 + \left(1406 \right)^2 + \left( 2032\right)^2 + \left(3078 \right)^2 }}\\ &=0.0004176 \end{align*}`
fr: :nbsphinx-math:``begin{align*} &\text{Cosine distance} \\\N &= 1 - \left( \frac{\left( x_{\text{band 1}}^{(t)} \right) \left(m_{\text{\a1}} \right) + \left( x_{\text{\a1}}^{(t)}) \right) \left(m_{\text{band 2}} \right) + \cdots + \left( x_{\text{band p}}^{(t)} \right) \left(m_{\text{band p}} \right)}{ \left(\sqrt{\left( x_{\text{band 1}}^{(t)} \right)^2 + \cdots+ \left( x_{\text{band p}}^{(t)} \right)^2} \right) \left( \sqrt{\left( m_{\text{band 1} \right)^2 + \cdots+ \left( m_{\text{band p}} \right)^2 } \right)} \right) \\N &= 1 -\\N & \N \frac{\left( x_{\text{blue}}^{(t)} \right) \left(m_{\text{\blue}} \right) + \left( x_{\text{\\}}^{(t)}) \right) \left(m_{\text{green}} \right) + \left( x_{{\text{red}}^{(t)}) \right) \left(m_{\text{red}} \right) + \left( x_{\text{nir1}}^{(t)} \right) \left(m_{\text{nir1}} \right)}{\sqrt{\left( x_{\text{blue}^{(t)}) \right)^2 + \left( x_{{text{green}}^{(t)}) \Retour)^2 + \Ngauche( x_{{text{rouge}}^{(t)}) \right)^2+ \left( x_{\text{{nir1}}^{(t)}) \right)^2}\sqrt{\left( m_{\text{blue} \right)^2 + \left( m_{\text{verte} \right)^2 + \left( m_{\text{rouge}} \right)^2 + \left(m_{\text{nir1}\right)^2 } }\\ &= 1 -\\\N & \N \Nfrac{\N{\c}Gauche( 1028 \right) \NGauche(969 \right) + \NGauche(1468 \right) \NGauche(1406 \right) + \NGauche(2176 \right) \NGauche(2032 \right) + \left( 3090 \right) \left(3078\right)}{\sqrt{\left( 1028 \right)^2 + \left( 1468\right)^2 + \left( 2176 \right)^2+ \left(3090\right)^2} \sqrt{\left( 969 \right)^2 + \left(1406 \right)^2 + \left( 2032 \right)^2 + \left(3078 \right)^2 }\\\N &=0.0004176 \end{align*}`

source: Example: calculating Bray-Curtis dissimilarity
fr: Exemple : calcul de la dissimilarité de Bray-Curtis

source: Using the example multispectral data from Table A.1, we can manually calculate the value of the Bray-Curtis dissimilarity for timestep :math:`t`.
fr: En utilisant l'exemple de données multispectrales du tableau A.1, nous pouvons calculer manuellement la valeur de la dissimilarité de Bray-Curtis pour le pas de temps :math:`t`.

source: :nbsphinx-math:`\begin{align*} &\text{Bray-Curtis dissimilarity} \\ &= \frac{\left| x_{\text{band 1}}^{(t)} - m_{\text{band 1}}\right| + \left| x_{\text{band 2}}^{(t)} - m_{\text{band 2}} \right| + \dots + \left| x_{\text{band p}}^{(t)} - m_{\text{band p}} \right| }{ \left| x_{\text{band 1}}^{(t)} + m_{\text{band 1}} \right| + \left| x_{\text{band 2}}^{(t)} + m_{\text{band 2}} \right| + \dots + \left| x_{\text{band p}}^{(t)} + m_{\text{band p}} \right|} \\ &= \frac{\left| x_{\text{nir1}}^{(t)} - m_{\text{nir1}}\right| + \left| x_{\text{green}}^{(t)} - m_{\text{green}} \right| + \left| x_{\text{red}}^{(t)} - m_{\text{red}} \right| + \left| x_{\text{blue}}^{(t)} - m_{\text{blue}} \right|}{\left| x_{\text{nir1}}^{(t)} + m_{\text{nir1}}\right| + \left| x_{\text{green}}^{(t)} + m_{\text{green}} \right| + \left| x_{\text{red}}^{(t)} + m_{\text{red}} \right| + \left| x_{\text{blue}}^{(t)} + m_{\text{blue}} \right|} \\ &= \frac{\left| 3090 - 3078\right| + \left| 1468 - 1406 \right| + \left|2176 - 2032 \right| + \left| 1028 - 969 \right|}{\left| 3090 + 3078\right| + \left| 1468 + 1406 \right| + \left|2176 + 2032 \right| + \left| 1028 + 969 \right|}\\ &= 0.01817 \end{align*}`
fr: :nbsphinx-math:`\begin{align*} &\text{{dissemblance de Bray-Curtis} \\\\N &= \frac{\left| x_{\text{\band 1}}^{(t)} - m_{\text{\c} 1}}\right| + \left| x_{\text{\c} 2}}^{(t)} - m_{\text{\}{\i1}de la bande 2}} \right| + \dots + \left| x_{\text{\band p}}^{(t)} - m_{\text{\c} de la bande p}} \right| }{ \left| x_{\text{\}band 1}}^{(t)} + m_{\text{\text{\}} de la bande 1} \right| + \left| x_{\text{\band 2}}^{(t)} + m_{\text{\}{\i1}de la bande 2}} \right| + \dots + \left| x_{\text{band p}}^{(t)} + m_{\text{\}band p}} \right|} \\\\N- &= \frac{\N-ft| x_{\text{\nir1}}^{(t)} - m_{\text{\nir1}}\right| + \left| x_{\text{\reen}}^{(t)} - m_{\text{\}} vert}} Droite + gauche x_{\text{\c} rouge}^{\c}} - m_{\text{\c}} rouge \Droit| + \NGauche| x_{\text{\c} bleu}}^{\c} - m_{\text{\}} bleu{\}} \right|}{\left| x_{\text{nir1}}^{(t)} + m_{\text{\c}nir1}\right|| + \Ngauche| x_{\text{\c}}^{(t)} + m_{\text{\}} vert{\r}} \Droit| + \NGauche| x_{\text{\c}}^{(t)} + m_{\text{\c} rouge}} \droite| + \Ngauche| x_{\text{\} bleu}^{(t)} + m_{\text{\c} bleu}}. \right|} \\\\N &= \frac{\N- 3090 - 3078\N-right| + \N-ft| 1468 - 1406 \N-right| + \N-ft|2176 - 2032 \N-right| + \N-ft| 1028 - 969 \right|}{\left| 3090 + 3078 \right| + \left| 1468 + 1406 \right| + \left|2176 + 2032 \right| + \left| 1028 + 969 \right|}\\ &= 0.01817 \end{align*}`

source: Landsat Collection 2 Level-2 Surface Reflectance
fr: Réflectance de surface de la collection Landsat 2 niveau 2

source: **Date modified:** 28 April 2021
fr: **Date de modification:** 28 avril 2021

source: This dataset is expected to be available to users second quarter of 2021.
fr: Cet ensemble de données devrait être disponible pour les utilisateurs au deuxième trimestre de 2021.

source: Digital Earth Africa (DE Africa) provides free and open access to a copy of `Landsat Collection 2 Level-2 <https://www.usgs.gov/core-science-systems/nli/landsat/landsat-collection-2-level-2-science-products>`__ products over Africa. These products are produced and provided by the United States Geological Survey (USGS).
fr: Digital Earth Africa (DE Africa) fournit un accès libre et gratuit à une copie des produits `Landsat Collection 2 Level-2 <https://www.usgs.gov/core-science-systems/nli/landsat/landsat-collection-2-level-2-science-products>`__ au-dessus de l'Afrique. Ces produits sont réalisés et fournis par le United States Geological Survey (USGS).

source: The `Landsat series <https://www.usgs.gov/core-science-systems/nli/landsat>`__ of Earth Observation satellites, jointly led by USGS and NASA, have been continuously acquiring images of the Earth’s land surface since 1972. DE Africa provides data from Landsat 5, 7 and 8 satellites, including historical observations dating back to late 1980s and regularly updated new acquisitions.
fr: La série `Landsat <https://www.usgs.gov/core-science-systems/nli/landsat>`__ de satellites d'observation de la Terre, dirigée conjointement par l'USGS et la NASA, acquiert continuellement des images de la surface terrestre depuis 1972. DE Africa fournit des données provenant des satellites Landsat 5, 7 et 8, y compris des observations historiques remontant à la fin des années 1980 et de nouvelles acquisitions régulièrement mises à jour.

source: New Level-2 Landsat 7 and Landsat 8 data are available after 15 to 27 days from acquisition. See `Landsat Collection 2 Generation Timeline <https://www.usgs.gov/media/images/landsat-collection-2-generation-timeline>`__ for details.
fr: Les nouvelles données Landsat 7 et Landsat 8 de niveau 2 sont disponibles après 15 à 27 jours d'acquisition. Voir `Landsat Collection 2 Generation Timeline <https://www.usgs.gov/media/images/landsat-collection-2-generation-timeline>`__ pour plus de détails.

source: USGS Landsat Collection 2 was released early 2021 and offers improved processing, geometric accuracy, and radiometric calibration compared to previous Collection 1 products. The Level-2 products are endorsed by the Committee on Earth Observation Satellites (CEOS) to be Analysis Ready Data for Land (`CARD4L <https://ceos.org/ard/>`__)-compliant. This internationally-recognised certification ensures these products have been processed to a minimum set of requirements and organised into a form that allows immediate analysis with a minimum of additional user effort and interoperability both through time and with other datasets.
fr: La collection USGS Landsat 2 a été publiée début 2021 et offre un traitement, une précision géométrique et un étalonnage radiométrique améliorés par rapport aux produits de la collection 1 précédente. Les produits de niveau 2 sont approuvés par le Comité sur les satellites d'observation de la Terre (CEOS) pour être conformes à la norme Analysis Ready Data for Land (`CARD4L <https://ceos.org/ard/>`__). Cette certification reconnue au niveau international garantit que ces produits ont été traités selon un ensemble minimal d'exigences et organisés sous une forme permettant une analyse immédiate avec un minimum d'effort supplémentaire pour l'utilisateur et une interopérabilité dans le temps et avec d'autres ensembles de données.

source: USGS Landsat Collection 2 Level-2 includes:
fr: La collection USGS Landsat 2 de niveau 2 comprend :

source: Surface Reflectance
fr: Réflectance de la surface

source: Surface Temperature
fr: Température de surface

source: This document provides technical specifications for the Surface Reflectance product. Information for the Surface Temperature product can be found in the `Landsat Collection 2 Level-2 Surface Temperature specification <https://docs.digitalearthafrica.org/en/latest/data_specs/Landsat_C2_ST_specs.html>`__.
fr: Ce document fournit des spécifications techniques pour le produit Réflectance de surface. Les informations relatives au produit Température de surface se trouvent dans la `Spécification de la température de surface de niveau 2 de la Collection 2 de Landsat <https://docs.digitalearthafrica.org/en/latest/data_specs/Landsat_C2_ST_specs.html>`__.

source: Surface reflectance is the fraction of incoming solar radiation that is reflected from Earth’s surface. Variations in satellite measured radiance due to atmospheric properties have been corrected for so images acquired over the same area at different times are comparable and can be used readily to detect changes on Earth’s surface.
fr: La réflectance de la surface est la fraction du rayonnement solaire entrant qui est réfléchie par la surface de la Terre. Les variations de la radiance mesurée par satellite dues aux propriétés atmosphériques ont été corrigées de sorte que les images acquises sur la même zone à des moments différents sont comparables et peuvent être utilisées facilement pour détecter les changements à la surface de la Terre.
