Repository: digitalearthafrica/deafrica-docs
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Contact & Help
fr: Contact et aide

source: Contact us on helpdesk@digitalearthafrica.org.
fr: Contactez-nous sur helpdesk@digitalearthafrica.org.

source: If you need assistance with code or other technical matters, please post a question on the `GIS Stack Exchange <https://gis.stackexchange.com/questions/ask?tags=open-data-cube>`_ using the ``open-data-cube`` tag.
fr: Si vous avez besoin d'aide pour le code ou d'autres questions techniques, veuillez poster une question sur le `GIS Stack Exchange <https://gis.stackexchange.com/questions/ask?tags=open-data-cube>`_ en utilisant le tag ``open-data-cube``.

source: You can also view `previous asked questions <https://gis.stackexchange.com/questions/tagged/open-data-cube>`_
fr: Vous pouvez également consulter les `premières questions posées <https://gis.stackexchange.com/questions/tagged/open-data-cube>`_.

source: To talk to the DE Africa community, please join the `Open Data Cube Slack <http://slack.opendatacube.org/>`_, and join the ``#de-africa`` channel.
fr: Pour parler à la communauté DE Afrique, veuillez rejoindre le `Open Data Cube Slack <http://slack.opendatacube.org/>`_, et rejoindre le canal ``#de-africa``.

source: Glossary
fr: Glossaire

source: Agro-Ecological Zone. Several DE Africa datasets, such as Water Observations from Space, use AEZs to subdivide the African continent when performing data validation and accuracy assessments.
fr: Zone Agro-Ecologique. Plusieurs jeux de données DE Africa, tels que Water Observations from Space, utilisent les AEZ pour subdiviser le continent africain lors de la validation et de l'évaluation de la précision des données.

source: Application Programming Interface. The Open Data Cube Application Programming Interface gives programmers full access to the capabilities of the Cube, allowing query and advanced data retrieval.
fr: Interface de programmation d'applications. L'interface de programmation d'applications de l'Open Data Cube donne aux programmeurs un accès complet aux capacités du Cube, permettant des requêtes et une extraction avancée des données.

source: Analysis Ready Data. Data which has been pre-processed and compiled to make it more accessible. This makes it easier for users to perform their own analysis.
fr: Données prêtes à être analysées. Données qui ont été prétraitées et compilées pour les rendre plus accessibles. Cela permet aux utilisateurs d'effectuer plus facilement leur propre analyse.

source: Amazon Resource Name. The naming method used by Amazon Web Services to unambiguously specify resources.
fr: Nom de ressource Amazon. La méthode de dénomination utilisée par Amazon Web Services pour spécifier sans ambiguïté les ressources.

source: Amazon Web Services. Cloud computing infrastructure provided by Amazon (United States).
fr: Amazon Web Services. Infrastructure informatique en nuage fournie par Amazon (États-Unis).

source: Committee on Earth Observations. An international panel focusing on the interoperability, validation, and coordination of Earth observation activities. See https://ceos.org/.
fr: Comité sur les observations de la Terre. Un groupe international qui se concentre sur l'interopérabilité, la validation et la coordination des activités d'observation de la Terre. Voir https://ceos.org/.

source: Cloud Optimized GeoTIFF. A data file format optimised for efficient workflows on the cloud and remote reading. See https://www.cogeo.org/.
fr: GeoTIFF optimisé pour le cloud. Un format de fichier de données optimisé pour des flux de travail efficaces sur le cloud et la lecture à distance. Voir https://www.cogeo.org/.

source: DE Africa Notebooks
fr: Cahiers DE Afrique

source: Digital Earth Africa Notebooks. An open-source repository containing Jupyter Notebooks, tools and workflows for geospatial analysis with Open Data Cube and xarray. See https://github.com/digitalearthafrica/deafrica-sandbox-notebooks.
fr: Digital Earth Africa Notebooks. Un référentiel open-source contenant des Jupyter Notebooks, des outils et des flux de travail pour l'analyse géospatiale avec Open Data Cube et xarray. Voir https://github.com/digitalearthafrica/deafrica-sandbox-notebooks.

source: Digital Earth Africa Sandbox. A learning and analysis environment for getting started with DE Africa and the Open Data Cube. It includes sample data and Jupyter notebooks that demonstrate the capability of the Open Data Cube.
fr: Digital Earth Africa Sandbox. Un environnement d'apprentissage et d'analyse pour démarrer avec DE Africa et l'Open Data Cube. Il comprend des échantillons de données et des carnets de notes Jupyter qui démontrent les capacités du cube de données ouvert.

source: DE Africa
fr: DE Afrique

source: Digital Earth Africa. DE Africa delivers routine, reliable and operational services using Earth observations to produce decision-ready products for policy, science and industry. For more information see https://www.digitalearthafrica.org/.
fr: Digital Earth Africa. DE Africa fournit des services de routine, fiables et opérationnels en utilisant les observations de la Terre pour produire des produits prêts à être utilisés pour la politique, la science et l'industrie. Pour plus d'informations, voir https://www.digitalearthafrica.org/.

source: Earth Observation. The field of gathering information about Earth using surveying techniques such as satellite-based remote sensing, or ground-based data collection.
fr: Observation de la Terre. Le domaine de la collecte d'informations sur la Terre à l'aide de techniques de surveillance telles que la télédétection par satellite ou la collecte de données au sol.

source: European Space Agency
fr: Agence spatiale européenne

source: Food and Agriculture Organization of the United Nations
fr: Organisation des Nations unies pour l'alimentation et l'agriculture

source: Fractional Cover. Fractional Cover (FC) is a measurement that splits the landscape into three parts, or fractions; green (leaves, grass, and growing crops), brown (branches, dry grass or hay, and dead leaf litter), and bare ground (soil or rock).
fr: Couverture fractionnée. La couverture fractionnée (CF) est une mesure qui divise le paysage en trois parties, ou fractions : le vert (feuilles, herbe et cultures en croissance), le brun (branches, herbe sèche ou foin, et litière de feuilles mortes) et le sol nu (terre ou roche).

source: Geomedian and Median Absolute Deviation product.
fr: Produit Geomedian et Median Absolute Deviation.

source: A robust high-dimensional statistic that maintains relationships between spectral bands. Forms part of the GeoMAD product.
fr: Une statistique robuste à haute dimension qui maintient les relations entre les bandes spectrales. Fait partie du produit GeoMAD.

source: Google Earth Engine
fr: Moteur Google Earth

source: Geographic Information System
fr: Système d'information géographique

source: A user-friendly file type that allows code to be run and presented alongside explanatory documentation, figures, and scientific notation. Has the file extension .ipynb.
fr: Un type de fichier convivial qui permet d'exécuter un code et de le présenter avec une documentation explicative, des figures et une notation scientifique. Possède l'extension de fichier .ipynb.

source: An interactive web-based user interface for editing and running Jupyter Notebooks. JupyterLab is used as an analysis environment on the DE Africa Sandbox.
fr: Une interface utilisateur interactive basée sur le web pour éditer et exécuter les Jupyter Notebooks. JupyterLab est utilisé comme environnement d'analyse sur la Sandbox de DE Africa.

source: A joint NASA/USGS program of medium resolution satellites that have been collecting publicly available Earth observation data continuously since 1972.
fr: Un programme conjoint de la NASA et de l'USGS composé de satellites à moyenne résolution qui collectent en permanence des données d'observation de la Terre accessibles au public depuis 1972.

source: Median Absolute Deviation. In DE Africa, MADs are a measure used to quantify variation in the geomedian. Forms part of the GeoMAD product, where three different MADs are used: Euclidean MAD, Spectral MAD, and Bray-Curtis MAD.
fr: Écart absolu médian. En Afrique de l'Est, les MAD sont une mesure utilisée pour quantifier la variation du géomedien. Fait partie du produit GeoMAD, où trois MAD différentes sont utilisées : MAD euclidienne, MAD spectrale et MAD de Bray-Curtis.

source: Moderate Resolution Imaging Spectroradiometer, a sensor on board NASA's Terra and Aqua satellites that collects publicly-available low resolution Earth observation data every one to two days.
fr: Spectroradiomètre imageur à résolution modérée, un capteur embarqué à bord des satellites Terra et Aqua de la NASA qui collecte tous les jours ou tous les deux jours des données d'observation de la Terre à basse résolution accessibles au public.

source: National Aeronautics and Space Administration (United States)
fr: National Aeronautics and Space Administration (États-Unis)

source: Normalised Burn Ratio, calculated from near-infrared (NIR) and short wave infrared (SWIR).
fr: Rapport de combustion normalisé, calculé à partir du proche infrarouge (NIR) et de l'infrarouge à ondes courtes (SWIR).

source: Normalised Difference Vegetation Index, calculated from visible and near-infrared light reflected by vegetation.
fr: Indice de végétation par différence normalisée, calculé à partir de la lumière visible et proche infrarouge réfléchie par la végétation.

source: Near Infrared, referring to particular bands used to collect Earth observation data
fr: Infrarouge proche, faisant référence à des bandes particulières utilisées pour collecter des données d'observation de la Terre

source: Open Data Cube, an international open-source project developing the technology that powers Digital Earth Africa. For more information see http://opendatacube.org/.
fr: Open Data Cube, un projet international à code source ouvert développant la technologie qui alimente Digital Earth Africa. Pour plus d'informations, voir http://opendatacube.org/.

source: OGC Web Services. Geospatial services for data access, display and processing.
fr: Services Web de l'OGC. Services géospatiaux pour l'accès, l'affichage et le traitement des données.

source: The programming language used to develop the Open Data Cube. It is easy to use while still allowing high performance access and processing capabilities. See http://www.python.org/ for more information.
fr: Le langage de programmation utilisé pour développer l'Open Data Cube. Il est facile à utiliser tout en permettant un accès et des capacités de traitement très performants. Voir http://www.python.org/ pour plus d'informations.

source: Synthetic Aperture Radar
fr: Radar à ouverture synthétique

source: Sentinel
fr: Sentinelle

source: A series of satellites from the ESA Copernicus programme. They collect publicly-available Earth observation data. The program includes the Sentinel-2 multispectral instrument mission, and the Sentinel-1 SAR mission.
fr: Une série de satellites du programme Copernicus de l'ESA. Ils collectent des données d'observation de la Terre accessibles au public. Le programme comprend la mission d'instrumentation multispectrale Sentinel-2, et la mission SAR Sentinel-1.

source: The SpatioTemporal Asset Catalog (STAC) is a specification that provides a common language to describe a range of geospatial information, so it can more easily be indexed and discovered. A 'spatiotemporal asset' is any file that represents information about the earth captured in a certain space and time. See https://stacspec.org/.
fr: Le SpatioTemporal Asset Catalog (STAC) est une spécification qui fournit un langage commun pour décrire une gamme d'informations géospatiales, afin qu'elles puissent être plus facilement indexées et découvertes. Un "bien spatio-temporel" est un fichier qui représente des informations sur la terre capturées dans un certain espace et temps. Voir https://stacspec.org/.

source: United States Geological Survey
fr: Commission géologique des États-Unis

source: Water Observations from Space, a Digital Earth Africa product that provides images and data showing where water has been seen in by satellites.
fr: Observations de l'eau depuis l'espace, un produit de Digital Earth Africa qui fournit des images et des données montrant où l'eau a été vue par des satellites.

source: An open source project and Python package that for working with labelled multi-dimensional arrays such as those returned by the Open Data Cube (ODC). See http://xarray.pydata.org/.
fr: Un projet open source et un paquetage Python qui permet de travailler avec des tableaux multidimensionnels étiquetés tels que ceux renvoyés par l'Open Data Cube (ODC). Voir http://xarray.pydata.org/.

source: Training
fr: Formation

source: A 6-part training course is available at:
fr: Un cours de formation en 6 parties est disponible sur le site :

source: It covers:
fr: Il couvre :

source: Using the Digital Earth Africa Sandbox
fr: Utilisation du bac à sable Digital Earth Africa

source: The data products available through Digital Earth Africa
fr: Les produits de données disponibles sur Digital Earth Africa

source: Using the Map Portal
fr: Utilisation du portail cartographique

source: Generating cloud-free composites
fr: Génération de composites sans nuages

source: Calculating indices
fr: Calcul des indices

source: Analysing vegetation and water resources
fr: Analyse de la végétation et des ressources en eau

source: ALOS PALSAR, ALOS-2 PALSAR-2 and JERS-1 SAR Annual Mosaic
fr: Mosaïque annuelle du SAR ALOS PALSAR, ALOS-2 PALSAR-2 et JERS-1

source: **Date modified:** 28 Apr 2021
fr: **Date de modification:** 28 Apr 2021

source: Product overview
fr: Aperçu du produit

source: Background
fr: Contexte

source: Synthetic Aperture Radar (SAR) data have been shown to provide different and complementary information to the more common optical remote sensing data. Radar backscatter response is a function of topography, land cover structure, orientation, and moisture characteristics—including vegetation biomass—and the radar signal can penetrate clouds, providing information about the earth’s surface where optical sensors cannot. Digital Earth Africa provides access to Normalized Radar Backscatter data, for which Radiometric Terrain Correction (RTC) has been applied so data acquired with different imaging geometries over the same region can be compared.
fr: Il a été démontré que les données du radar à synthèse d'ouverture (SAR) fournissent des informations différentes et complémentaires des données de télédétection optique plus courantes. La réponse de rétrodiffusion radar est une fonction de la topographie, de la structure de la couverture terrestre, de l'orientation et des caractéristiques d'humidité - y compris la biomasse végétale - et le signal radar peut pénétrer les nuages, fournissant des informations sur la surface de la terre là où les capteurs optiques ne le peuvent pas. Digital Earth Africa donne accès aux données de rétrodiffusion radar normalisées, pour lesquelles la correction radiométrique du terrain (RTC) a été appliquée afin de pouvoir comparer les données acquises avec différentes géométries d'imagerie sur la même région.

source: The ALOS/PALSAR annual mosaic is a global 25 m resolution dataset that combines data from many images captured by JAXA’s PALSAR and PALSAR-2 sensors on ALOS-1 and ALOS-2 satellites respectively. This product contains radar measurement in L-band and in HH and HV polarizations. It has a spatial resolution of 25 m and is available annually for 2007 to 2010 (ALOS/PALSAR) and 2015 to 2018 (ALOS-2/PALSAR-2).
fr: La mosaïque annuelle ALOS/PALSAR est un jeu de données mondial d'une résolution de 25 m qui combine les données de nombreuses images capturées par les capteurs PALSAR et PALSAR-2 de JAXA sur les satellites ALOS-1 et ALOS-2 respectivement. Ce produit contient des mesures radar en bande L et en polarisations HH et HV. Il a une résolution spatiale de 25 m et est disponible annuellement pour 2007 à 2010 (ALOS/PALSAR) et 2015 à 2018 (ALOS-2/PALSAR-2).

source: The JERS annual mosaic is generated from images acquired by the SAR sensor on the Japanese Earth Resources Satellite-1 (JERS-1) satellite. This product contains radar measurement in L-band and HH polarization. It has a spatial resolution of 25 m and is available for 1996.
fr: La mosaïque annuelle JERS est générée à partir d'images acquises par le capteur SAR du satellite Japanese Earth Resources Satellite-1 (JERS-1). Ce produit contient des mesures radar en bande L et en polarisation HH. Il a une résolution spatiale de 25 m et est disponible pour 1996.

source: These mosaic data part of a global dataset provided by the Japan Aerospace Exploration Agency (JAXA) Earth Observation Research Center.
fr: Ces données en mosaïque font partie d'un ensemble de données mondiales fournies par le Centre de recherche en observation de la Terre de l'Agence japonaise d'exploration aérospatiale (JAXA).

source: For more information on the product, see https://www.eorc.jaxa.jp/ALOS/en/palsar_fnf/fnf_index.htm
fr: Pour plus d'informations sur le produit, voir https://www.eorc.jaxa.jp/ALOS/en/palsar_fnf/fnf_index.htm.

source: Specifications
fr: Spécifications

source: DE Africa provides ALOS/ALOS-2 PALSAR/PALSAR-2 Mosaic and JERS-1 Mosaic as two seperate products. Relevant coverage and metadata can be viewed on DE Africa Metadata Exploer:
fr: DE Africa fournit ALOS/ALOS-2 PALSAR/PALSAR-2 Mosaic et JERS-1 Mosaic comme deux produits distincts. La couverture et les métadonnées pertinentes peuvent être consultées sur DE Africa Metadata Exploer :

source: `ALOS/ALOS-2 PALSAR/PALSAR-2 Mosaic <https://explorer.digitalearth.africa/products/alos_palsar_mosaic>`__
fr: `ALOS/ALOS-2 PALSAR/PALSAR-2 Mosaïque <https://explorer.digitalearth.africa/products/alos_palsar_mosaic>`__

source: **Table 1: SAR annual mosaic product specifications**
fr: **Tableau 1 : Spécifications des produits de la mosaïque annuelle SAR**.

source: Launch date
fr: Date de lancement

source: Feb 11, 1992
fr: 11 février 1992

source: Jan 24, 2006
fr: 24 janvier 2006

source: May 24, 2014
fr: 24 mai 2014

source: Frequency
fr: Fréquence

source: L-band (1.27 GHz)
fr: Bande L (1,27 GHz)

source: L-band
fr: Bande L

source: Number of bands
fr: Nombre de bandes

source: Cell size - X (degree)
fr: Taille de la cellule - X (degré)

source: Cell size - Y (degree)
fr: Taille de la cellule - Y (degré)

source: Coordinate reference system
fr: Système de référence des coordonnées

source: Temporal resolution
fr: Résolution temporelle

source: Annual
fr: Annuel

source: Temporal range
fr: Plage temporelle

source: More information about the dataset can be found in the `dataset description document <https://www.eorc.jaxa.jp/ALOS/en/palsar_fnf/DatasetDescription_PALSAR2_Mosaic_FNF_revI.pdf>`__
fr: Plus d'informations sur l'ensemble de données peuvent être trouvées dans le document `dataset description <https://www.eorc.jaxa.jp/ALOS/en/palsar_fnf/DatasetDescription_PALSAR2_Mosaic_FNF_revI.pdf>`__.

source: **Table 2: ALOS/ALOS-2 annual mosaic measurements**
fr: **Tableau 2 : Mesures annuelles de la mosaïque ALOS/ALOS-2**.

source: Band ID
fr: ID de la bande

source: Data type
fr: Type de données

source: No data\ :math:`^\dagger`
fr: Pas de données... :math:`^^dagger`.

source: HV backscatter
fr: Rétrodiffusion HV

source: Observation date (days since launch)
fr: Date d'observation (jours depuis le lancement)

source: Local incidence angle
fr: Angle d'incidence locale

source: mask
fr: masque

source: Processing mask information
fr: Traitement des informations relatives aux masques

source: :math:`^\dagger` No data or fill value.
fr: :math:`^\dagger` Aucune donnée ou valeur de remplissage.

source: Backscatter data is provided as digital number (DN), which can be converted to backscatter in decibel unit using :math:`10*log10(𝐷𝑁^2)-83.0`.
fr: Les données de rétrodiffusion sont fournies sous forme de nombre numérique (DN), qui peut être converti en rétrodiffusion en décibel en utilisant :math:`10*log10(𝐷𝑁^2)-83.0`.

source: **Table 3: JERS annual mosaic measurements**
fr: **Tableau 3 : Mesures annuelles de la mosaïque JERS**.

source: Backscatter data is provided as digital number (DN), which can be converted to backscatter in decibel unit using :math:`10*log10(𝐷𝑁^2)-84.66`.
fr: Les données de rétrodiffusion sont fournies sous forme de nombre numérique (DN), qui peut être converti en rétrodiffusion en décibel en utilisant :math:`10*log10(𝐷𝑁^2)-84.66`.

source: For the ALOS and JERS mosaics, a data mask is provided that can be used to exclude pixels with potentially problematic measurements.
fr: Pour les mosaïques ALOS et JERS, un masque de données est fourni et peut être utilisé pour exclure les pixels dont les mesures pourraient poser problème.

source: **Table 4: Processing mask specification.**
fr: **Tableau 4 : Spécification du masque de traitement.**

source: Value
fr: Valeur

source: no_data
fr: pas de données

source: water
fr: eau

source: lay_over
fr: escale

source: shadowing
fr: filature

source: land
fr: terrain

source: Processing
fr: Traitement

source: The ALOS/PALSAR annual mosaic is a global 25 m resolution dataset that combines data from many images captured by JAXA’s PALSAR and PALSAR-2 sensors on ALOS-1 and ALOS-2 satellites respectively. The JERS annual mosaic is generated from images acquired by the SAR sensor on the Japanese Earth Resources Satellite-1 (JERS-1) satellite.
fr: La mosaïque annuelle ALOS/PALSAR est un jeu de données mondial d'une résolution de 25 m qui combine les données de nombreuses images capturées par les capteurs PALSAR et PALSAR-2 de la JAXA sur les satellites ALOS-1 et ALOS-2 respectivement. La mosaïque annuelle JERS est générée à partir d'images acquises par le capteur SAR du satellite Japanese Earth Resources Satellite-1 (JERS-1).

source: Media and example images
fr: Médias et exemples d'images

source: **Figure 1: ALOS false color composites (HH, HV, HV/HH) over an area near Cairo, Egypt, showing changes in crop pattern from year to year.**
fr: **Figure 1 : Composites fausses couleurs ALOS (HH, HV, HV/HH) au-dessus d'une zone proche du Caire, en Egypte, montrant les changements dans la configuration des cultures d'une année sur l'autre.

source: Related services
fr: Services connexes

source: References
fr: Références

source: `JAXA Global PALSAR-2/PALSAR/JERS-1 Mosaic <https://www.eorc.jaxa.jp/ALOS/en/palsar_fnf/fnf_index.htm>`__
fr: `JAXA Global PALSAR-2/PALSAR/JERS-1 Mosaïque <https://www.eorc.jaxa.jp/ALOS/en/palsar_fnf/fnf_index.htm>`__

source: License
fr: Licence

source: This dataset is available to use with no charge under the `Terms for Use <https://earth.jaxa.jp/policy/en.html>`__.
fr: Cet ensemble de données peut être utilisé gratuitement dans le cadre des `Termes d'utilisation <https://earth.jaxa.jp/policy/en.html>`__.

source: Acknowledgements
fr: Remerciements

source: This dataset is part of a global product provided by the Japan Aerospace Exploration Agency (JAXA).
fr: Ce jeu de données fait partie d'un produit global fourni par l'Agence japonaise d'exploration aérospatiale (JAXA).

source: Data access
fr: Accès aux données

source: This product is available in AWS S3.
fr: Ce produit est disponible dans AWS S3.

source: **Table 5: AWS data access details.**
fr: **Tableau 5 : Détails de l'accès aux données AWS.**

source: AWS S3 details
fr: Détails sur AWS S3

source: Bucket ARD
fr: Seau ARD

source: Region
fr: Région

source: The bucket is in the AWS region ``af-south-1`` (Cape Town). Additional region specifications can be applied as follows:
fr: Le seau se trouve dans la région AWS ``af-south-1`` (Cape Town). Des spécifications de région supplémentaires peuvent être appliquées comme suit :
