Repository: digitalearthafrica/deafrica-docs
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr

source: **Table 1: Landsat Collection 2 Level-2 Surface Temperature product specifications**
fr: **Tableau 1 : Spécifications du produit Landsat Collection 2 Level-2 Surface Temperature**.

source: **Table 2: Landsat 5 and Landsat 7 Surface Temperature Level-2 measurements**
fr: **Tableau 2 : Mesures de température de surface de niveau 2 de Landsat 5 et Landsat 7**.

source: Surface temperature band 6 (Thermal Infrared (TIR))
fr: Bande 6 de température de surface (infrarouge thermique (TIR))

source: Thermal radiance
fr: Rayonnement thermique

source: Upwell radiance
fr: Radiance Upwell

source: Downwell radiance
fr: Rayonnement vers le bas

source: Atmospheric transmittance
fr: Transmittance atmosphérique

source: Emissivity
fr: Emissivité

source: Emissivity standard deviation
fr: Écart type d'émissivité

source: Distance to cloud
fr: Distance par rapport au nuage

source: Kilometers
fr: Kilomètres

source: Surface temperature uncertainty
fr: Incertitude de la température de surface

source: **Table 3: Landsat 8 Level-2 Surface Temperature measurements**
fr: **Tableau 3 : Mesures de température de surface Landsat 8 Niveau 2**.

source: Surface temperature band 10 (TIR)
fr: Bande de température de surface 10 (TIR)

source: Landsat Collection 2 Level-2 products are processed by the USGS from Collection 2 Level-1 inputs. Landsat 5, 7 and 8 surface temperature products are generated using the Landsat surface temperature algorithm.
fr: Les produits Landsat Collection 2 Level-2 sont traités par l'USGS à partir des entrées Collection 2 Level-1. Les produits de température de surface Landsat 5, 7 et 8 sont générés à l'aide de l'algorithme de température de surface Landsat.

source: **Figure 1: Landsat false color composites (highlighting vegetation, top row) and corresponding surface temperature measurements (in Kelvin, bottom row) over an area in Tripoli District, Libya.**
fr: **Figure 1 : Composites fausses couleurs Landsat (mettant en évidence la végétation, ligne supérieure) et mesures correspondantes de la température de surface (en Kelvin, ligne inférieure) sur une zone du district de Tripoli, Libye.

source: Landsat Level- 2 Surface Temperature Science Product courtesy of the U.S. Geological Survey.
fr: Produit scientifique de température de surface Landsat Level- 2, gracieuseté de l'U.S. Geological Survey.

source: **Table 6: AWS data access details.**
fr: **Tableau 6 : Détails de l'accès aux données AWS.**

source: **Table 7: AWS file path convention.**
fr: **Tableau 7 : Convention de chemin d'accès aux fichiers AWS.**

source: **Table 8: OWS data access details.**
fr: **Tableau 8 : Détails de l'accès aux données OWS.**

source: **ODC product names:** ``ls5_st``, ``ls7_st``, ``ls8_st``
fr: Noms de produits **ODC:** ``ls5_st``, ``ls7_st``, ``ls8_st``

source: **Table 9: Landsat 5 and Landsat 7 Level-2 Surface Temperature (ODC product ls5_st and ls7_st) band names.**
fr: **Tableau 9 : Noms des bandes de température de surface de niveau 2 de Landsat 5 et Landsat 7 (produit ODC ls5_st et ls7_st).

source: band_6, st, surface_temperature
fr: bande_6, st, température_de_surface

source: trad, thermal_radiance
fr: trad, rayonnement thermique

source: atran, atmospheric_transmittance
fr: atran, transmittance_atmosphérique

source: emis, emissivity
fr: emis, émissivité

source: st_qa, surface_temperature_quality
fr: st_qa, qualité_de_la_température_de_surface

source: **Table 10: Landsat 8 Level-2 Surface Temperature (ODC product ls8_st) band names.**
fr: **Tableau 10 : Température de surface Landsat 8 Level-2 (produit ODC ls8_st) : noms des bandes.

source: band_10, st, surface_temperature
fr: bande_10, st, température_de_surface

source: The surface temperature product is generated from the Landsat Collection 2 Level-1 thermal infrared bands, Top of Atmosphere (TOA) reflectance, TOA brightness temperature, Advanced Spaceborne Thermal Emission and Reflection Radiometer (ASTER) Global Emissivity Database (GED) data, ASTER Normalized Difference Vegetation Index (NDVI) data, and atmospheric profiles of geopotential height, specific humidity, and air temperature extracted from Goddard Earth Observing System (GEOS) Model Version 5 Forward Processing Instrument Teams (FP-IT) (for acquisitions from 2000 to present) or Modern Era Retrospective analysis for Research and Applications Version 2 (MERRA-2) (for acquisitions from 1982 to 1999).
fr: Le produit de la température de surface est généré à partir des bandes infrarouges thermiques de niveau 1 de la collection 2 de Landsat, de la réflectance du sommet de l'atmosphère (TOA), de la température de brillance du TOA, des données de la base de données sur l'émissivité globale (GED) de l'Advanced Spaceborne Thermal Emission and Reflection Radiometer (ASTER), des données de l'indice de végétation par différence normalisée (NDVI) de l'ASTER, et les profils atmosphériques de la hauteur géopotentielle, de l'humidité spécifique et de la température de l'air extraits du modèle Goddard Earth Observing System (GEOS) version 5 Forward Processing Instrument Teams (FP-IT) (pour les acquisitions de 2000 à aujourd'hui) ou Modern Era Retrospective analysis for Research and Applications Version 2 (MERRA-2) (pour les acquisitions de 1982 à 1999).

source: For more information and caveats of the product, visit the `Landsat Collection 2 Surface Temperature webpage <https://www.usgs.gov/core-science-systems/nli/landsat/landsat-collection-2-surface-temperature>`__.
fr: Pour plus d'informations et de mises en garde sur le produit, visitez la page web `Landsat Collection 2 Surface Temperature <https://www.usgs.gov/core-science-systems/nli/landsat/landsat-collection-2-surface-temperature>`__.

source: The surface temperature product is provided at 30 m spatial sampling, however, the thermal sensors vary in spectral response, sensitivity and resolution.
fr: Le produit de la température de surface est fourni avec un échantillonnage spatial de 30 m. Cependant, les capteurs thermiques varient en termes de réponse spectrale, de sensibilité et de résolution.

source: **Table 11: Landsat thermal sensors specification.**
fr: **Tableau 11 : Spécifications des capteurs thermiques Landsat.

source: Sensor
fr: Capteur

source: Spetral Band
fr: Bande spetrale

source: Wavelength (µm)
fr: Longueur d'onde (µm)

source: Spatial Resolution (m)
fr: Résolution spatiale (m)

source: Thermal Infrared Sensor (TIRS)
fr: Capteur infrarouge thermique (TIRS)

source: Enhanced Thematic Mapper Plus (ETM+)
fr: Cartographie thématique améliorée Plus (ETM+)

source: Thematic Mapper (TM)
fr: Cartographe thématique (TM)

source: The Level-2 product provides a number of intermediate and quality bands for surface temperature measurement. These bands may help interpret the results.
fr: Le produit Level-2 fournit un certain nombre de bandes intermédiaires et de qualité pour la mesure de la température de surface. Ces bandes peuvent aider à interpréter les résultats.

source: **Table 12: Surface temperature relevant bands.**
fr: **Tableau 12 : Bandes de température de surface pertinentes**.

source: Explanation
fr: Explication

source: Surface temperature (ST)
fr: Température de surface (ST)

source: The temperature of the Earth’s surface in Kelvin (K).
fr: La température de la surface de la Terre en Kelvin (K).

source: Thermal radiance (ST_TRAD)
fr: Radiance thermique (ST_TRAD)

source: The values produced when thermal band reflectance is converted to radiance.
fr: Les valeurs produites lorsque la réflectance de la bande thermique est convertie en radiance.

source: Upwell radiance (ST_URAD)
fr: Radiance ascendante (ST_URAD)

source: The amount of electromagnetic radiation reflected upward from the ground’s surface.
fr: La quantité de rayonnement électromagnétique réfléchi vers le haut à partir de la surface du sol.

source: Downwellradiance (ST_DRAD)
fr: Rayonnement de fond (ST_DRAD)

source: The thermal energy radiated onto the ground by all objects in a hemisphere surrounding it.
fr: L'énergie thermique rayonnée sur le sol par tous les objets d'un hémisphère qui l'entoure.

source: Atmospheric transmittance (ST_ATRAN)
fr: Transmittance atmosphérique (ST_ATRAN)

source: The ratio of the transmitted radiation to the total radiation incident upon the medium (atmosphere).
fr: Le rapport entre le rayonnement transmis et le rayonnement total incident sur le milieu (atmosphère).

source: Emissivity (ST_EMIS)
fr: Emissivité (ST_EMIS)

source: The ratio of the energy radiated from a material’s surface to that radiated from a blackbody.
fr: Le rapport entre l'énergie rayonnée par la surface d'un matériau et celle rayonnée par un corps noir.

source: Emissivity_stdev (ST_EMSD)
fr: Emissivité_stdev (ST_EMSD)

source: The extent of deviation of the emissivity product. This layer is used along with cloud_distance to create the quality assessment product.
fr: L'étendue de la déviation du produit d'émissivité. Cette couche est utilisée avec cloud_distance pour créer le produit d'évaluation de la qualité.

source: Distance to cloud (ST_CDIST)
fr: Distance par rapport au nuage (ST_CDIST)

source: The distance, in kilometers, that a pixel is from the nearest cloud pixel. This layer is used along with emissivity_stdev to create the quality assessment product.
fr: La distance, en kilomètres, qui sépare un pixel du pixel de nuage le plus proche. Cette couche est utilisée avec emissivity_stdev pour créer le produit d'évaluation de la qualité.

source: Surface temperature uncertainty (ST_QA)
fr: Incertitude de la température de surface (ST_QA)

source: Provides the Surface Temperature product uncertainty using a combination of uncertainty values and distance to cloud values.
fr: Fournit l'incertitude du produit Température de surface en utilisant une combinaison de valeurs d'incertitude et de valeurs de distance aux nuages.

source: Water Observations from Space
fr: Observations de l'eau depuis l'espace

source: **Date modified:** 24 March 2021
fr: **Date de modification:** 24 mars 2021

source: The WOfS product suite is currently a beta product generated from provisional Landsat 8 satellite observations, and will be operationalised in the second quarter of 2021 to use full Landsat Collection 2 data.
fr: La suite de produits WOfS est actuellement un produit bêta généré à partir d'observations provisoires du satellite Landsat 8, et sera rendue opérationnelle au deuxième trimestre de 2021 pour utiliser les données complètes de la collection Landsat 2.

source: Water Observations from Space (WOfS) is a service that draws on satellite imagery to provide historical surface water observations of the whole African continent. WOfS allows users to understand the location and movement of water present in the African landscape by giving them an improved understanding of where water is usually present; where it is seldom observed; and where inundation of the surface has been observed by satellite.
fr: Water Observations from Space (WOfS) est un service qui s'appuie sur l'imagerie satellitaire pour fournir des observations historiques des eaux de surface sur l'ensemble du continent africain. WOfS permet aux utilisateurs de comprendre la localisation et le mouvement de l'eau présente dans le paysage africain en leur donnant une meilleure compréhension des endroits où l'eau est habituellement présente, de ceux où elle est rarement observée et de ceux où l'inondation de la surface a été observée par satellite.

source: They are generated using the WOfS classification algorithm on Landsat 8 satellite data. There are several WOfS products available for the African continent, as listed below:
fr: Ils sont générés en utilisant l'algorithme de classification WOfS sur les données du satellite Landsat 8. Il existe plusieurs produits WOfS disponibles pour le continent africain, comme indiqué ci-dessous :

source: Product Type
fr: Type de produit

source: WOfS Feature Layer (WOFL)
fr: Couche de caractéristiques WOfS (WOFL)

source: WOfS slices generated per scene
fr: Tranches de WOfS générées par scène

source: WOfS Annual Summary
fr: Résumé annuel du WOfS

source: The ratio (%) of wet to clear observations from each calendar year
fr: Le rapport (%) entre les observations humides et claires pour chaque année civile.

source: WOfS All-Time Summary
fr: Résumé de tous les temps de WOfS

source: The ratio (%) of wet to clear observations over all time
fr: Le rapport (%) entre les observations humides et les observations claires sur l'ensemble du temps.

source: **WOfS Feature Layer (WOFL):** Individual water-classified images are called Water Observation Feature Layers (WOFLs), and are created from the input satellite data. There is one WOFL for each satellite dataset processed for the occurrence of water.
fr: **Couche de caractéristiques d'observation de l'eau (WOFL):** Les images individuelles classées par eau sont appelées couches de caractéristiques d'observation de l'eau (WOFL) et sont créées à partir des données satellitaires d'entrée. Il existe une WOFL pour chaque ensemble de données satellitaires traitées pour la présence d'eau.

source: **WOfS Annual/All-Time Summary:** The percentage of time a pixel was classified as wet. This requires:
fr: **WOfS Annual/All-Time Summary:** Le pourcentage de temps pendant lequel un pixel a été classé comme humide. Ceci nécessite :

source: Total number of clear observations for each pixel: the number of observations that were clear (no cloud or shadow) for the selected time period. The classification algorithm then assigns these as either wet, or dry.
fr: Nombre total d'observations claires pour chaque pixel : le nombre d'observations qui étaient claires (sans nuage ni ombre) pour la période sélectionnée. L'algorithme de classification les classe ensuite comme humides ou sèches.

source: Total number of wet observation for each pixel: the number of observations that were clear *and* wet for the selected time period.
fr: Nombre total d'observations humides pour chaque pixel : le nombre d'observations qui étaient claires *et* humides pour la période sélectionnée.

source: The WOfS summaries are calculated as the ratio of clear wet observations to total clear observations, expressed as a percentage.
fr: Les résumés WOfS sont calculés comme le rapport entre les observations humides claires et le total des observations claires, exprimé en pourcentage.

source: There are several datasets that are available as part of the WOfS suite. Relevant coverage and metadata can be viewed on DE Africa `Metadata Explorer <https://explorer.digitalearth.africa/products>`__:
fr: Plusieurs jeux de données sont disponibles dans le cadre de la suite WOfS. La couverture et les métadonnées pertinentes peuvent être consultées sur DE Africa `Metadata Explorer <https://explorer.digitalearth.africa/products>`__ :

source: WOfS Feature Layer
fr: Couche de caractéristiques WOfS

source: **Table 1: WOfS Feature Layer product specifications**
fr: **Tableau 1 : Spécifications des produits de la couche de fonctionnalité WOfS**.

source: 16 days
fr: 16 jours

source: Provisional Landsat 8 Collection 2
fr: Collection provisoire de Landsat 8 2

source: Not applicable for beta products
fr: Non applicable pour les produits bêta

source: **Table 2: WOfS Feature Layer measurements**
fr: **Tableau 2 : Mesures de la couche de caractéristiques du WOfS**.

source: WOFL water
fr: Eau WOFL

source: The WOFL measurement ``water`` uses bit flags to allocate terrain characteristics to each pixels. Bit flags assign a unique decimal value to each characteristic. A pixel can hold multiple characteristics by summing the decimal values of each associated bit flag.
fr: La mesure WOFL "eau" utilise des drapeaux binaires pour attribuer des caractéristiques de terrain à chaque pixel. Les drapeaux binaires attribuent une valeur décimale unique à chaque caractéristique. Un pixel peut contenir plusieurs caractéristiques en additionnant les valeurs décimales de chaque drapeau binaire associé.

source: **Table 3: WOfS Feature Layer bit flags**
fr: **Tableau 3 : drapeaux binaires de la couche de caractéristiques WOfS**.

source: Flagging
fr: Signalisation

source: Decimal Value
fr: Valeur décimale

source: no data
fr: pas de données

source: 1 = pixel masked out due to NO_DATA in source, 0 = valid data
fr: 1 = pixel masqué en raison de NO_DATA dans la source, 0 = données valides

source: non-contiguity
fr: non-contiguïté

source: Lack of data contiguity
fr: Manque de contiguïté des données

source: sea
fr: mer

source: Sea
fr: Mer

source: terrain shadow / low solar angle
fr: ombre du terrain / faible angle solaire

source: Terrain shadow or low solar angle
fr: Ombre du terrain ou faible angle solaire

source: high slope
fr: haute pente

source: High slope
fr: Pente élevée

source: cloud shadow
fr: ombre de nuage

source: cloud
fr: nuage

source: water observed
fr: eau observée

source: Water present
fr: Présence d'eau

source: For example, a ``water`` value of ``136`` indicates water (``128``) AND terrain shadow / low solar angle (``8``) were observed for the pixel, whereas a value of ``144`` would indicate water (``128``) AND high slope (``16``).
fr: Par exemple, une valeur "eau" de 136 indique que de l'eau (128) ET une ombre de terrain/un angle solaire faible (8) ont été observés pour le pixel, tandis qu'une valeur de 144 indique de l'eau (128) ET une pente élevée (16).

source: WOFLs are useful for identifying the presence of water at a certain point in time, or over short durations (less than one year). For annual or historical data, users can access the pre-calculated summary products detailed below.
fr: Les WOFL sont utiles pour identifier la présence d'eau à un moment donné, ou sur de courtes durées (moins d'un an). Pour les données annuelles ou historiques, les utilisateurs peuvent accéder aux produits récapitulatifs pré-calculés détaillés ci-dessous.

source: **Table 4: WOfS Annual Summary product specifications**
fr: **Tableau 4 : Spécifications des produits du résumé annuel du WOfS**.

source: **Table 5: WOfS Annual Summary measurements**
fr: **Tableau 5 : Résumé annuel des mesures du WOfS**.

source: count_wet
fr: compte_humide

source: How many times a pixel was wet
fr: Combien de fois un pixel a été mouillé

source: How many times a pixel was clear
fr: Combien de fois un pixel était clair

source: frequency
fr: fréquence

source: Frequency of water detection at a location
fr: Fréquence de la détection de l'eau à un endroit donné

source: **Table 6: WOfS All-Time Summary specifications**
fr: **Tableau 6 : WOfS All-Time Summary specifications**

source: One summary for entire temporal range
fr: Un seul résumé pour toute la gamme temporelle

source: **Table 7: WOfS All-Time Summary measurements**
fr: **Tableau 7 : Résumé des mesures de tous les temps du WOfS**.

source: All products in the WOfS suite have the same geographic extent. This is shown in Figure 1; data is available for the regions shaded in blue. Specific temporal and geographic extents can be explored as an interactive map on the Digital Earth Africa `Metadata Explorer <https://explorer.digitalearth.africa/products>`__. Different WOfS products can be selected from the horizontal dropdown menu at the top of the page.
fr: Tous les produits de la suite WOfS ont la même étendue géographique. Ceci est illustré dans la figure 1 ; les données sont disponibles pour les régions ombrées en bleu. Les étendues temporelles et géographiques spécifiques peuvent être explorées sous forme de carte interactive sur le Digital Earth Africa `Metadata Explorer <https://explorer.digitalearth.africa/products>`__. Différents produits WOfS peuvent être sélectionnés dans le menu déroulant horizontal en haut de la page.

source: **Figure 1: Landsat WOfS suite geographic extent**
fr: **Figure 1 : étendue géographique de la suite Landsat WOfS**.

source: The `Water Observations from Space Detection Algorithm <https://github.com/GeoscienceAustralia/wofs>`__ as described in `Mueller, 2016 <https://doi.org/10.1016/j.rse.2015.11.003>`__, is applied to the Landsat data to create the available WOfS products.
fr: L'algorithme de détection des observations de l'eau depuis l'espace <https://github.com/GeoscienceAustralia/wofs>`__ tel que décrit dans `Mueller, 2016 <https://doi.org/10.1016/j.rse.2015.11.003>`__, est appliqué aux données Landsat pour créer les produits WOfS disponibles.

source: **Image 1: Tagrin Bay, Sierra Leone. WOfS All-Time Summary.**
fr: **Image 1 : Tagrin Bay, Sierra Leone. Résumé de tous les temps de WOfS.**

source: Colours indicate the percentage of times water was detected. Red is “rarely water”, green is “often water”, and blue is “always water”.
fr: Les couleurs indiquent le pourcentage de fois où de l'eau a été détectée. Le rouge correspond à "rarement de l'eau", le vert à "souvent de l'eau" et le bleu à "toujours de l'eau".

source: Credit: U.S. Geological Survey Landsat data was used in compiling this image.
fr: Crédit : U.S. Geological Survey Les données Landsat ont été utilisées pour compiler cette image.

source: Mueller, N., Lewis, A., Roberts, D., Ring, S., Melrose, R., Sixsmith, J., Lymburner, L., McIntyre, A., Tan, P., Curnow, S., & Ip, A. (2016). Water observations from space: Mapping surface water from 25 years of Landsat imagery across Australia. Remote Sensing of Environment, 174, 341–352. `https://doi.org/10.1016/j.rse.2015.11.003 <%5Bhttps://doi.org/10.1016/j.rse.2015.11.003%5D>`__
fr: Mueller, N., Lewis, A., Roberts, D., Ring, S., Melrose, R., Sixsmith, J., Lymburner, L., McIntyre, A., Tan, P., Curnow, S. et Ip, A. (2016). Observations de l'eau depuis l'espace : Cartographie des eaux de surface à partir de 25 ans d'imagerie Landsat à travers l'Australie. Télédétection de l'environnement, 174, 341-352. `https://doi.org/10.1016/j.rse.2015.11.003 <%5Bhttps://doi.org/10.1016/j.rse.2015.11.003%5D>`__

source: Acknowledgments
fr: Remerciements

source: The WOfS algorithms incorporated in this product are the work of Norman Mueller, Geoscience Australia, and Dr Dale Roberts, Australian National University.
fr: Les algorithmes WOfS incorporés dans ce produit sont le fruit du travail de Norman Mueller, Geoscience Australia, et du Dr Dale Roberts, Australian National University.

source: Data Access
fr: Accès aux données

source: The DE Africa WOfS product suite is available in AWS S3 thanks to the Public Dataset Program.
fr: La suite de produits DE Africa WOfS est disponible dans AWS S3 grâce au programme de données publiques.

source: **Table 8: AWS data access details**
fr: **Tableau 8 : Détails de l'accès aux données AWS**.

source: Product names
fr: Noms des produits

source: The bucket is located in the region ``us-west-2`` (Oregon).
fr: Le seau est situé dans la région "us-west-2" (Oregon).

source: The following file path convention applies to WOFLs:
fr: La convention de chemin d'accès aux fichiers suivante s'applique aux WOFL :

source: Annual Summaries omit ``path``, ``row``, ``month`` and ``day``.
fr: Les résumés annuels omettent ``chemin``, ``ligne``, ``mois`` et ``jour``.

source: The All-Time Summary additionally drops ``year``.
fr: Dans le résumé de tous les temps, le mot "année" est supprimé.

source: **Table 9: AWS file path convention**
fr: **Tableau 9 : Convention de chemin d'accès aux fichiers AWS**.

source: ``product name``
fr: Nom du produit

source: ``ga_ls8c_wofs_2``, ``ga_ls8c_wofs_2_annual_summary``, or ``ga_ls8c_wofs_2_summary``
fr: ``ga_ls8c_wofs_2``, ``ga_ls8c_wofs_2_annual_summary``, ou ``ga_ls8c_wofs_2_summary``.

source: ``path number``
fr: ``numéro du chemin``

source: Ranges from ``157`` to ``206``.
fr: La gamme s'étend de 157 à 206.

source: ``row number``
fr: Numéro de ligne

source: Ranges from ``052`` to ``072``.
fr: S'étend de ``052`` à ``072``.

source: Year the data was collected
fr: Année de collecte des données
