Repository: digitalearthafrica/deafrica-docs
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr

source: The file paths follow the format ``<productname>/<year>/<tile_id>/``.
fr: Les chemins des fichiers suivent le format "<<nom du produit>/<année>/<identifiant du textile>/``.

source: **Table 6: AWS file path convention.**
fr: **Tableau 6 : Convention de chemin d'accès aux fichiers AWS.**

source: File path element
fr: Élément de chemin d'accès au fichier

source: Example
fr: Exemple

source: Product name, ``alos_palsar_mosaic`` or ``jers_sar_mosaic``
fr: Nom du produit, "alos_palsar_mosaic" ou "jers_sar_mosaic".

source: ``alos_palsar_mosaic``
fr: ``alos_palsar_mosaique``

source: ``year``
fr: ``année``

source: Observation year
fr: Année d'observation

source: 5x5 deg tile labeld by southwest corner coordinates
fr: Carreau 5x5 deg étiqueté par les coordonnées du coin sud-ouest

source: OGC Web Services (OWS)
fr: Services Web de l'OGC (OWS)

source: This product is available through DE Africa’s OWS.
fr: Ce produit est disponible auprès de l'OWS de DE Africa.

source: **Table 7: OWS data access details.**
fr: **Tableau 7 : Détails de l'accès aux données OWS.**

source: OWS details
fr: Détails de l'OWS

source: Name
fr: Nom

source: Web Map Services (WMS) URL
fr: URL des services cartographiques Web (WMS)

source: Web Coverage Service (WCS) URL
fr: URL du service de couverture Web (WCS)

source: Layer name
fr: Nom de la couche

source: ``alos_palsar_mosaic``, ``jers_sar_mosaic``
fr: mosaïque "alos_palsar", "mosaïque "jers_sar"".

source: Digital Earth Africa OWS details can be found at https://ows.digitalearth.africa/.
fr: Les détails de Digital Earth Africa OWS peuvent être trouvés sur https://ows.digitalearth.africa/.

source: For instructions on how to connect to OWS, see `this tutorial <https://training.digitalearthafrica.org/en/latest/OWS_tutorial.html>`__.
fr: Pour obtenir des instructions sur la manière de se connecter à OWS, consultez `ce tutoriel <https://training.digitalearthafrica.org/en/latest/OWS_tutorial.html>`__.

source: The Landsat Collection 2 Level-2 products can be accessed through the Digital Earth Africa ODC API, which is available through the `Digital Earth Africa Sandbox <https://sandbox.digitalearth.africa/hub/login>`__.
fr: Les produits Landsat Collection 2 Level-2 sont accessibles par l'API ODC de Digital Earth Africa, qui est disponible dans le `Digital Earth Africa Sandbox <https://sandbox.digitalearth.africa/hub/login>`__.

source: **ODC product names:** ``alos_palsar_mosaic``, ``jers_sar_mosaic``
fr: **Noms de produits **ODC : "Alos_palsar_mosaique", "Jers_sar_mosaique".

source: Specific bands of data can be called by using either the default names or any of a band’s alternative names, as listed in the table below. ODC ``Datacube.load`` commands without specified bands will load all bands.
fr: Des bandes de données spécifiques peuvent être appelées en utilisant soit les noms par défaut, soit l'un des noms alternatifs d'une bande, comme indiqué dans le tableau ci-dessous. Les commandes ``Datacube.load`` de l'ODC sans bandes spécifiées chargeront toutes les bandes.

source: **Table 8: ALOS/ALOS-2 annual mosaic (ODC product alos_palsar_mosaic) band names.**
fr: **Tableau 8 : mosaïque annuelle ALOS/ALOS-2 (produit ODC alos_palsar_mosaic) noms des bandes.**

source: Band name
fr: Nom du groupe

source: Alternative names
fr: Noms alternatifs

source: Fill value
fr: Valeur de remplissage

source: local incidence angle, incidence
fr: angle d'incidence locale, incidence

source: **Table 9: JERS-1 annual mosaic (ODC product jers_sar_mosaic) band names.**
fr: **Tableau 9 : mosaïque annuelle JERS-1 (produit ODC jers_sar_mosaic) noms des bandes.**

source: Band names are case-sensitive.
fr: Les noms des groupes sont sensibles à la casse.

source: For examples on how to use the ODC API, see the DE Africa `example notebook repository <https://github.com/digitalearthafrica/deafrica-sandbox-notebooks>`__.
fr: Pour des exemples sur la façon d'utiliser l'API ODC, voir le dépôt DE Africa `example notebook <https://github.com/digitalearthafrica/deafrica-sandbox-notebooks>`__.

source: Technical information
fr: Informations techniques

source: Radiometric terrain correction
fr: Correction radiométrique du terrain

source: See relevant section in the `Sentinel-1 SAR backscatter product specification <https://docs.digitalearthafrica.org/en/latest/data_specs/Sentinel-1_specs.html#Radiometric-terrain-correction>`__.
fr: Voir la section pertinente dans la spécification du produit de rétrodiffusion SAR de Sentinel-1 <https://docs.digitalearthafrica.org/en/latest/data_specs/Sentinel-1_specs.html#Radiometric-terrain-correction>`__.

source: Sentinel-2 Annual GeoMAD
fr: Sentinel-2 GeoMAD annuel

source: **Date modified:** 21 April 2021
fr: **Date de modification:** 21 avril 2021

source: GeoMAD is the the Digital Earth Africa (DE Africa) Sentinel-2 annual geomedian and triple Median Absolute Deviation product. It is a cloud-free composite of Sentinel-2 satellite data compiled for each calendar year.
fr: GeoMAD est le produit annuel de Digital Earth Africa (DE Africa) Sentinel-2 sur la géomédecine et la triple déviation médiane absolue. Il s'agit d'un composite sans nuage des données du satellite Sentinel-2 compilé pour chaque année civile.

source: GeoMAD has two main components:
fr: GeoMAD comporte deux composantes principales :

source: Median Absolute Deviations (MADs)
fr: Écarts absolus médians (MAD)

source: The geomedian product combines measurements collected in each year to produce one representative, multispectral measurement for every 10 x 10 square metre unit of the African continent. The end result is a comprehensive dataset that can be used to generate true-colour images for visual inspection of anthropogenic or natural landmarks. The full spectral dataset can be used to develop more complex algorithms. The product leverages Sentinel-2’s high-frequency flyovers, with the annual time interval allowing for 70 to 140 satellite passes of any given location. This helps scope out perpetually cloudy areas. For each pixel, invalid data is discarded, and remaining observations are mathematically summarised using the geomedian statistic.
fr: Le produit geomedian combine les mesures collectées chaque année pour produire une mesure multispectrale représentative pour chaque unité de 10 x 10 mètres carrés du continent africain. Le résultat final est un jeu de données complet qui peut être utilisé pour générer des images en couleurs vraies pour l'inspection visuelle de repères anthropiques ou naturels. Le jeu de données spectrales complet peut être utilisé pour développer des algorithmes plus complexes. Le produit s'appuie sur les survols à haute fréquence de Sentinel-2, l'intervalle de temps annuel permettant d'effectuer 70 à 140 passages du satellite sur un lieu donné. Cela permet de repérer les zones perpétuellement nuageuses. Pour chaque pixel, les données non valides sont éliminées et les observations restantes sont résumées mathématiquement à l'aide de la statistique géomédienne.

source: Variations between the geomedian and the individual measurements are captured by the three Median Absolute Deviation (MAD) layers. These are higher-order statistical measurements calculating variation relative to the geomedian. The MAD layers can be used on their own or together with geomedian to gain insights about the land surface and understand change over time.
fr: Les variations entre le géomédien et les mesures individuelles sont saisies par les trois couches de déviation absolue médiane (MAD). Il s'agit de mesures statistiques d'ordre supérieur qui calculent la variation par rapport à la géomédiane. Les couches MAD peuvent être utilisées seules ou avec la géomédienne pour obtenir des informations sur la surface du sol et comprendre les changements dans le temps.

source: The GeoMAD dataset is annual (one value per pixel per band per calendar year) and spans continental Africa. GeoMAD metadata can also be viewed on Digital Earth Africa’s `Metadata Explorer <https://explorer.digitalearth.africa/products/ga_s2_gm>`__.
fr: Le jeu de données GeoMAD est annuel (une valeur par pixel par bande par année civile) et couvre l'Afrique continentale. Les métadonnées GeoMAD peuvent également être consultées sur le `Metadata Explorer <https://explorer.digitalearth.africa/products/ga_s2_gm>`__ de Digital Earth Africa.

source: **Table 1: GeoMAD product specifications**
fr: **Tableau 1 : Spécifications du produit GeoMAD**.

source: Specification
fr: Spécifications

source: Product name
fr: Nom du produit

source: Annual Sentinel-2 GeoMAD
fr: Annuel Sentinel-2 GeoMAD

source: Cell size - X (metres)
fr: Taille de la cellule - X (mètres)

source: Cell size - Y (metres)
fr: Taille de la cellule - Y (mètres)

source: Coordinate reference system (CRS)
fr: Système de référence des coordonnées (CRS)

source: Parent dataset
fr: Ensemble de données parent

source: Sentinel-2 Level-2A
fr: Sentinel-2 niveau 2A

source: Update frequency
fr: Fréquence de mise à jour

source: **Figure 1: Sentinel-2 Annual GeoMAD geographic extent**
fr: **Figure 1 : Étendue géographique de la GeoMAD annuelle de Sentinel-2**.

source: Digital Earth Africa Sentinel-2 data is available for the regions shaded in blue. Specific temporal and geographic extents can be explored as an interactive map on the Digital Earth Africa `Metadata Explorer <https://explorer.digitalearth.africa/products/gm_s2_annual/extents>`__.
fr: Les données Sentinel-2 de Digital Earth Africa sont disponibles pour les régions ombragées en bleu. Les étendues temporelles et géographiques spécifiques peuvent être explorées sous forme de carte interactive sur le Digital Earth Africa `Metadata Explorer <https://explorer.digitalearth.africa/products/gm_s2_annual/extents>`__.

source: **Table 2: GeoMAD measurements**
fr: **Tableau 2 : Mesures GeoMAD**.

source: Value range
fr: Plage de valeurs

source: No data value
fr: Aucune valeur de données

source: Geomedian B02 (Blue)
fr: Geomedian B02 (Bleu)

source: Geomedian B03 (Green)
fr: Geomedian B03 (Vert)

source: Geomedian B04 (Red)
fr: Geomedian B04 (Rouge)

source: Geomedian B05 (Red edge 1)
fr: Geomedian B05 (bord rouge 1)

source: Geomedian B06 (Red edge 2)
fr: Geomedian B06 (bord rouge 2)

source: Geomedian B07 (Red edge 3)
fr: Geomedian B07 (bord rouge 3)

source: Geomedian B08 (Near infrared (NIR) 1)
fr: Geomedian B08 (proche infrarouge (NIR) 1)

source: Geomedian B11 (Short-wave infrared (SWIR) 1)
fr: Geomedian B11 (infrarouge à ondes courtes (SWIR) 1)

source: Spectral Median Absolute Deviation
fr: Écart absolu médian spectral

source: Euclidean Median Absolute Deviation
fr: Écart absolu médian euclidien

source: Bray-Curtis Median Absolute Deviation
fr: Écart absolu médian de Bray-Curtis

source: COUNT
fr: COMPTER

source: Number of clear observations
fr: Nombre d'observations claires

source: The GeoMAD dataset has fourteen bands of data which can be subdivided as follows:
fr: Le jeu de données GeoMAD comporte quatorze bandes de données qui peuvent être subdivisées comme suit :

source: **Geomedian — 10 bands:** The geomedian is calculated using ten spectral bands of Sentinel-2 data collected during one year. This results in the 10-band annual geomedian provided by the GeoMAD product. The ten geomedian surface reflectance bands are B02, B03, B04, B05, B06, B07, B08, B8A, B11, and B12. Surface reflectance values have been scaled between ``1`` and ``10000`` to allow for more efficient data storage as unsigned 16-bit integers (``uint16``). Note the raw Sentinel-2 product contains more bands, some of which are not used in GeoMAD.
fr: **Géomédian - 10 bandes:** Le géomédian est calculé à partir de dix bandes spectrales de données Sentinel-2 collectées pendant une année. On obtient ainsi le géomédian annuel à 10 bandes fourni par le produit GeoMAD. Les dix bandes de réflectance de surface du géomédian sont B02, B03, B04, B05, B06, B07, B08, B8A, B11 et B12. Les valeurs de réflectance de surface ont été mises à l'échelle entre ``1`` et ``10000`` pour permettre un stockage plus efficace des données sous forme d'entiers non signés de 16 bits (``uint16``). Notez que le produit brut Sentinel-2 contient plus de bandes, dont certaines ne sont pas utilisées dans GeoMAD.

source: The geomedian band IDs correspond to bands in the parent Sentinel-2 Level-2A data. For example, the GeoMAD band ``B02`` contains the annual geomedian of the Sentinel-2 ``B02`` band.
fr: Les ID des bandes géomédiennes correspondent aux bandes des données parentes Sentinel-2 Niveau 2A. Par exemple, la bande GeoMAD ``B02`` contient le géomédian annuel de la bande Sentinel-2 ``B02``.

source: **Median Absolute Deviations (MADs) — 3 bands:** Deviations from the annual geomedian are quantified through median absolute deviation calculations. The GeoMAD product utilises three MADs, each stored in a separate band: Euclidean MAD (EMAD), spectral MAD (SMAD), and Bray-Curtis MAD (BCMAD). Each MAD is calculated using the same ten bands as in the geomedian. SMAD and BCMAD are normalised ratios, therefore they are unitless and their values always fall between ``0`` and ``1``. EMAD is a function of surface reflectance but is neither a ratio nor normalised, therefore its valid value range depends on the number of bands used in the geomedian calculation — ten in GeoMAD.
fr: **Écarts absolus médians (MAD) - 3 bandes:** Les écarts par rapport à la géomédia annuelle sont quantifiés par des calculs d'écart absolu médian. Le produit GeoMAD utilise trois MAD, chacun étant stocké dans une bande distincte : MAD euclidienne (EMAD), MAD spectrale (SMAD), et MAD de Bray-Curtis (BCMAD). Chaque MAD est calculée en utilisant les mêmes dix bandes que dans le géomédian. SMAD et BCMAD sont des rapports normalisés, ils sont donc sans unité et leurs valeurs sont toujours comprises entre ``0`` et ``1``. EMAD est une fonction de la réflectance de la surface mais n'est ni un rapport ni normalisé, donc sa plage de valeurs valides dépend du nombre de bandes utilisées dans le calcul du géomédian - dix dans GeoMAD.

source: **Count — 1 band:** The number of clear satellite measurements of a pixel for that calendar year. This is around 60 to 70 for most pixels, but doubles at areas of overlap between scenes. “Count” is not incorporated in either the geomedian or MADs calculations. It is intended for metadata analysis and data validation.
fr: **Count - 1 band:** Le nombre de mesures satellitaires claires d'un pixel pour cette année civile. Ce nombre est d'environ 60 à 70 pour la plupart des pixels, mais il double dans les zones de chevauchement entre les scènes. Le "Count" n'est pas incorporé dans les calculs géomédiatiques ou MADs. Il est destiné à l'analyse des métadonnées et à la validation des données.

source: All clear observations for the given calendar year are collated from the parent dataset. Cloudy pixels are identified and excluded. The geomedian and MADs calculations are then performed by the `hdstats <https://libraries.io/pypi/hdstats>`__ package. 2017 – 2020 GeoMAD datasets use ``hdstats`` version 0.2.
fr: Toutes les observations claires pour l'année civile donnée sont rassemblées à partir de l'ensemble de données parent. Les pixels nuageux sont identifiés et exclus. Les calculs des géomédians et des MADs sont ensuite effectués par le paquet `hdstats <https://libraries.io/pypi/hdstats>`__. Les jeux de données GeoMAD 2017 - 2020 utilisent la version 0.2 de ``hdstats``.

source: **Image 1: Mangroves in Guinea-Bissau. 2019 geomedian, true-colour (RGB).**
fr: **Image 1 : Mangroves en Guinée-Bissau. 2019 geomedian, true-colour (RGB).**

source: Credit: Contains modified Copernicus Sentinel data 2019, processed by Digital Earth Africa.
fr: Crédit : Contient des données Copernicus Sentinel 2019 modifiées, traitées par Digital Earth Africa.

source: **Image 2: Croplands in South Africa. 2019 triple MADs, plotted as RGB.**
fr: **Image 2 : Terres cultivées en Afrique du Sud. MAD triples de 2019, tracées en RVB.**

source: `Sentinel-2 Level-2A <https://docs.digitalearthafrica.org/en/latest/data_specs/Sentinel-2_Level-2A_specs.html>`__
fr: `Sentinel-2 Niveau-2A <https://docs.digitalearthafrica.org/en/latest/data_specs/Sentinel-2_Level-2A_specs.html>`___.

source: `Landsat 8 Annual Geomedian 2018 <https://explorer.digitalearth.africa/products/ga_ls8c_gm_2_annual/extents>`__
fr: `Landsat 8 Geomedian Annuel 2018 <https://explorer.digitalearth.africa/products/ga_ls8c_gm_2_annual/extents>`__

source: Roberts, D., Mueller, N., & Mcintyre, A. (2017). High-dimensional pixel composites from Earth observation time series. *IEEE Transactions on Geoscience and Remote Sensing*, 55(11), 6254–6264. https://doi.org/10.1109/TGRS.2017.2723896
fr: Roberts, D., Mueller, N., & Mcintyre, A. (2017). Composites de pixels à haute dimension à partir de séries temporelles d'observation de la Terre. *IEEE Transactions on Geoscience and Remote Sensing*, 55(11), 6254-6264. https://doi.org/10.1109/TGRS.2017.2723896

source: Roberts, D., Dunn, B., Mueller, N. (2018). Open Data Cube products using high-dimensional statistics of time series. 8647-8650. https://doi.org/10.1109/IGARSS.2018.8518312.
fr: Roberts, D., Dunn, B., Mueller, N. (2018). Produits Open Data Cube utilisant des statistiques à haute dimension des séries temporelles. 8647-8650. https://doi.org/10.1109/IGARSS.2018.8518312.

source: CC BY Attribution 4.0 International License
fr: Licence internationale CC BY Attribution 4.0

source: The high-dimensional statistics algorithms incorporated in this product are the work of Dr Dale Roberts, Australian National University.
fr: Les algorithmes de statistiques à haute dimension incorporés dans ce produit sont le fruit du travail du Dr Dale Roberts, de l'Australian National University.

source: GeoMAD data can be accessed from the associated S3 bucket.
fr: Les données GeoMAD sont accessibles à partir du seau S3 associé.

source: **Table 3: AWS data access details**
fr: **Tableau 3 : Détails de l'accès aux données AWS**.

source: Bucket ARN
fr: Seau ARN

source: ``gm_s2_annual``
fr: ``gm_s2_annuel``

source: The file paths follow the format:
fr: Les chemins d'accès aux fichiers suivent le format :

source: **Table 4: AWS file path convention**
fr: **Tableau 4 : Convention de chemin d'accès aux fichiers AWS**.

source: Product version
fr: Version du produit

source: Tile number in the ``x`` direction.
fr: Numéro de tuile dans la direction "x".

source: Tile number in the ``y`` direction.
fr: Numéro de tuile dans la direction "y".

source: ``timeperiod``
fr: ``période de temps``

source: Year of data collection followed by period of time and time unit in the format ``YYYY--P<period><unit>``. Time units are designated by capitalised letters, ``Y`` for years and ``M`` for months. Annual data is ``P1Y`` while 6-monthly data is ``P6M``.
fr: Année de collecte des données suivie de la période et de l'unité de temps sous le format "AAAA--P<période><unité>". Les unités de temps sont désignées par des lettres majuscules, "A" pour les années et "M" pour les mois. Les données annuelles sont désignées par "P1Y" tandis que les données semestrielles sont désignées par "P6M".

source: ``x_y_timeperiod_band.extension``
fr: ``bande_de_temps_x_y.extension``

source: File name. Combines ``x``, ``y``, ``timeperiod`` with ``band``, using Band IDs, and file extensions. For most tiles, the file extension is ``.tif``.
fr: Nom de fichier. Combine ``x``, ``y``, ``timeperiod`` avec ``band``, en utilisant les ID de bande, et les extensions de fichier. Pour la plupart des tuiles, l'extension de fichier est ``.tif``.

source: Tile numbering uses 96 km grid squares based on the default CRS for this product, ``EPSG:6933``, with the origin set at the bottom-leftmost corner of the valid ``EPSG:6933`` region.
fr: La numérotation des tuiles utilise des carrés de grille de 96 km basés sur le CRS par défaut pour ce produit, ``EPSG:6933``, avec une origine fixée au coin inférieur gauche de la région valide ``EPSG:6933``.

source: **Table 5: OWS data access details**
fr: **Tableau 5 : Détails de l'accès aux données OWS**.

source: The GeoMAD dataset is not yet but will soon be accessible in the Digital Earth Africa ODC API, which is available through the `Digital Earth Africa Sandbox <https://sandbox.digitalearth.africa/hub/login>`__.
fr: Le jeu de données GeoMAD n'est pas encore mais sera bientôt accessible dans l'API ODC de Digital Earth Africa, qui est disponible via le `Digital Earth Africa Sandbox <https://sandbox.digitalearth.africa/hub/login>`__.

source: **ODC product name:** ``gm_s2_annual``
fr: Nom du produit **ODC:** ``gm_s2_annual``

source: Specific bands of data can be called by using either the default names or any of a band’s alternative names, as listed in the table below. ODC ``datacube.Datacube.load`` commands without specified bands will load all bands; see `ODC documentation <https://datacube-core.readthedocs.io/en/latest/dev/api/generate/datacube.Datacube.load.html>`__.
fr: Des bandes spécifiques de données peuvent être appelées en utilisant soit les noms par défaut, soit l'un des noms alternatifs d'une bande, comme indiqué dans le tableau ci-dessous. Les commandes ``datacube.Datacube.load`` sans bandes spécifiées chargeront toutes les bandes ; voir la documentation de l'ODC <https://datacube-core.readthedocs.io/en/latest/dev/api/generate/datacube.Datacube.load.html>`__.

source: **Table 6: GeoMAD ODC band names**
fr: **Tableau 6 : Noms des bandes de l'ODC de GeoMAD**.

source: band_02, blue
fr: band_02, bleu

source: band_03, green
fr: band_03, vert

source: band_04, red
fr: bande_04, rouge

source: band_05, red_edge_1
fr: bande_05, bord_rouge_1

source: band_06, red_edge_2
fr: bande_06, bord_rouge_2

source: band_07, red_edge_3
fr: bande_07, bord_rouge_3

source: band_8a, nir_narrow, nir_2
fr: bande_8a, nir_narrow, nir_2

source: band_12, swir_2, swir_22
fr: bande_12, tourbillon_2, tourbillon_22

source: count
fr: compter

source: Product names and band names are case-sensitive.
fr: Les noms de produits et de groupes sont sensibles à la casse.

source: Pixel composites are created by compiling multiple satellite observations of the same area to form one representative image. They have become a staple to Earth observation research as combining measurements compensates for missing data, such as gaps caused by cloud cover. This results in comprehensive datasets that allow thorough analysis of large areas of interest.
fr: Les composites de pixels sont créés en compilant plusieurs observations satellitaires de la même zone pour former une image représentative. Ils sont devenus un élément essentiel de la recherche sur l'observation de la Terre, car la combinaison des mesures compense les données manquantes, telles que les lacunes causées par la couverture nuageuse. Il en résulte des ensembles de données complets qui permettent une analyse approfondie de vastes zones d'intérêt.

source: There are many ways of forming this image. GeoMAD uses the *geomedian* summary statistic to combine a year of data into one scientifically-rigorous composite. It produces one multispectral observation for each pixel on continental Africa.
fr: Il existe de nombreuses façons de former cette image. GeoMAD utilise la statistique sommaire *geomedian* pour combiner une année de données en un composite scientifiquement rigoureux. Il produit une observation multispectrale pour chaque pixel de l'Afrique continentale.
