Repository: digitalearthafrica/deafrica-docs
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr

source: The geomedian statistic is sometimes referred to as the “geometric median”, as in the figure below. To remove ambiguity with other kinds of statistics with similar names, it is always referred to in DE Africa as the “geomedian”.
fr: La statistique géomédienne est parfois appelée "médiane géométrique", comme dans la figure ci-dessous. Pour lever toute ambiguïté avec d'autres types de statistiques portant des noms similaires, elle est toujours appelée "géomédiane" dans DE Africa.

source: **Figure 2: Illustrated explanation of the geomedian.**
fr: **Figure 2 : Explication illustrée du géomedien.**

source: Figure 2 uses a three-dimensional example to illustrate how the geomedian is calculated for a single pixel containing multiple measurements of red, blue and green data.
fr: La figure 2 utilise un exemple tridimensionnel pour illustrer comment le géomédian est calculé pour un seul pixel contenant plusieurs mesures de données rouges, bleues et vertes.

source: The dataset has :math:`N` timesteps of satellite data. In the case of Figure 2, :math:`N=20`
fr: L'ensemble de données comporte :math:`N` pas de temps de données satellitaires. Dans le cas de la figure 2, :math:`N=20`

source: Each timestep contains :math:`p` bands. In this case, :math:`p =3` (one dimension each for red, green, blue)
fr: Chaque pas de temps contient :math:`p` bandes. Dans ce cas, :math:`p =3` (une dimension pour le rouge, le vert et le bleu).

source: Therefore each timestep can be represented by a 3-dimensional vector :math:`\mathbf{x}`. A single vector at timestep :math:`t`, :math:`\mathbf{x}^{(t)}`, looks like this:
fr: Chaque pas de temps peut donc être représenté par un vecteur tridimensionnel :math:`\mathbf{x}`. Un vecteur unique au pas de temps :math:`t`, :math:`\mathbf{x}^{(t)}`, ressemble à ceci :

source: x^{(t)}_{red} \\ x^{(t)}_{green}\\ x^{(t)}_{blue}
fr: x^{(t)}_{rouge} \N- x^{(t)}_{verte}\N- x^{(t)}_{bleu}}

source: The entire dataset can be represented as the collection of the vectors at every timestep :math:`\mathbf{x}^{(1)}, \mathbf{x}^{(2)}, \dots \mathbf{x}^{(20)}`
fr: L'ensemble des données peut être représenté comme la collection des vecteurs à chaque pas de temps :math:`\mathbf{x}^{(1)}, \mathbf{x}^{(2)}, \dots \mathbf{x}^{(20)}`

source: Projected onto a plane, it will look like the plot in Figure 2.2 — twenty points placed depending on their values of red, green and blue. The geomedian of this pixel is then the point where the Euclidean distance (straight-line distance) between all data points is minimised. This is depicted in Figure 2.3; for further information on Euclidean distance, see the section below on the **Euclidean MAD**.
fr: Projeté sur un plan, il ressemblera au tracé de la figure 2.2 - vingt points placés en fonction de leurs valeurs de rouge, vert et bleu. Le géomédian de ce pixel est alors le point où la distance euclidienne (distance en ligne droite) entre tous les points de données est minimisée. Ceci est illustré à la figure 2.3 ; pour plus d'informations sur la distance euclidienne, voir la section ci-dessous sur la **DAM euclidienne**.

source: Let’s call the geomedian point in this example :math:`\mathbf{m}_\text{example}`. Euclidean distance between a point :math:`\mathbf{x}` and the data points :math:`\mathbf{x}^{(t)}` is given by :math:`\lVert \mathbf{x} - \mathbf{x}^{(t)} \rVert`. The point at which all twenty distances are minimised is found by taking the :math:`\mathrm{argmin}`; the argument of the minima. The geomedian can then be expressed by the following equation:
fr: Appelons le point géomédian dans cet exemple :math:`\mathbf{m}_\text{example}`. La distance euclidienne entre un point :math:`\mathbf{x}` et les points de données :math:`\mathbf{x}^{(t)}` est donnée par :math:`\lVert \mathbf{x} - \mathbf{x}^{(t)} \rVert`. Le point auquel les vingt distances sont minimisées est trouvé en prenant :math:`\mathrm{argmin}` ; l'argument des minima. Le géomédian peut alors être exprimé par l'équation suivante :

source: In this example, the resulting :math:`\mathbf{m}_\text{example}`, like any :math:`\mathbf{x}`, will be a 3-dimensional vector, with a value each for red, green, and blue.
fr: Dans cet exemple, le résultat :math:`\mathbf{m}_\text{example}`, comme tout :math:`\mathbf{x}`, sera un vecteur tridimensionnel, avec une valeur pour le rouge, le vert et le bleu.

source: m_{red} \\ m_{green}\\ m_{blue}
fr: m_{rouge} \\ m_{vert}\\N{\i1}m_{blue}}

source: The geomedian point :math:`\mathbf{m}` is not selected from one of the twenty data points. It is a separate vector with unique values that do not necessarily correspond to existing band values from the observation dataset.
fr: Le point géomédian :math:`\mathbf{m}` n'est pas sélectionné parmi les vingt points de données. Il s'agit d'un vecteur distinct avec des valeurs uniques qui ne correspondent pas nécessairement aux valeurs de bande existantes de l'ensemble de données d'observation.

source: The formula for the geomedian of a single pixel can be generalised for :math:`p` bands and :math:`N` timesteps, as given in `Roberts et al, 2017 <https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8004469>`__:
fr: La formule du géomédian d'un seul pixel peut être généralisée pour :math:`p` bandes et :math:`N` pas de temps, comme indiqué dans `Roberts et al, 2017 <https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8004469>`__ :

source: :nbsphinx-math:`\begin{align*} \mathbf{m} = \underset{\mathbf{x} \in \mathbb{R}^p}{\mathrm{argmin}} \sum^{N}_{t=1} \lVert \mathbf{x} - \mathbf{x}^{(t)} \rVert \end{align*}`
fr: :nbsphinx-math:``begin{align*} \mathbf{m} = \underset{\i} \mathbf{x} \in \mathbb{R}^p}{\mathrm{argmin}} \sum^{N}_{t=1} \lVert \mathbf{x} - \mathbf{x}^{(t)} \rVert \end{align*}`

source: In GeoMAD, the ten bands of the geomedian result in a 10-dimensional space. It is difficult to illustrate this example in ten dimensions — but we can instead provide the equation, and the form of the result. Here, the number of timesteps :math:`N` varies per pixel; pixels on the overlap between satellite swathes may have very large :math:`N` (up to around 140 per year), while pixels in the centre of the path are only observed once per flyover, and have :math:`N` closer to 70.
fr: Dans GeoMAD, les dix bandes du géomédian donnent un espace à dix dimensions. Il est difficile d'illustrer cet exemple en dix dimensions - mais nous pouvons plutôt fournir l'équation, et la forme du résultat. Ici, le nombre de pas de temps :math:`N` varie par pixel ; les pixels sur le chevauchement entre les bandes de satellites peuvent avoir des :math:`N` très grands (jusqu'à environ 140 par an), tandis que les pixels au centre de la trajectoire ne sont observés qu'une fois par survol, et ont des :math:`N` plus proches de 70.

source: m_{B02} \\ m_{B03}\\ m_{B04}\\ m_{B05} \\ m_{B06}\\ m_{B07}\\ m_{B08} \\ m_{B8A}\\ m_{B11}\\ m_{B12}
fr: m_{B02} \N- m_{B03}\N- m_{B04}\N- m_{B05} \N- m_{B06}\N- m_{B07}\N- m_{B08} \N- m_{B8A}\N- m_{B11}\N- m_{B12}

source: This calculation is repeated for every pixel in the specified extent.
fr: Ce calcul est répété pour chaque pixel de l'étendue spécifiée.

source: The significance of the geomedian is that all bands are considered simultaneously. This maintains the spectral relationship between bands, providing the most representative value. Additionally, the geomedian statistic reduces spatial noise and improves colour balance compared to similar statistics such as the median or medoid.
fr: La signification du géomédian est que toutes les bandes sont considérées simultanément. Cela permet de maintenir la relation spectrale entre les bandes, fournissant ainsi la valeur la plus représentative. En outre, la statistique géomédienne réduit le bruit spatial et améliore l'équilibre des couleurs par rapport à des statistiques similaires telles que la médiane ou la médiane.

source: The geomedian is therefore a vital foundational dataset for applications such as band index analysis on vegetation, water and urban area detection. It is also useful as a feature layer in machine learning algorithms.
fr: Le géomedien est donc un ensemble de données de base essentiel pour des applications telles que l'analyse de l'indice de bande sur la végétation, l'eau et la détection des zones urbaines. Il est également utile comme couche de caractéristiques dans les algorithmes d'apprentissage automatique.

source: DE Africa provides an interactive geomedian visualisation available as a downloadable `Jupyter Notebook widget <https://training.digitalearthafrica.org/en/latest/Geomedian_widget.html>`__. It graphically compares the geomedian to a median for a 3-D example. An example screenshot is shown below.
fr: DE Africa fournit une visualisation interactive du géomédian disponible sous forme de widget téléchargeable `Jupyter Notebook <https://training.digitalearthafrica.org/en/latest/Geomedian_widget.html>`__. Il compare graphiquement le géomédian à une médiane pour un exemple en 3D. Un exemple de capture d'écran est présenté ci-dessous.

source: **Figure 3: Geomedian visualisation widget.**
fr: **Figure 3 : widget de visualisation Geomedian.**

source: Triple Median Absolute Deviations (MADs)
fr: Écarts absolus médians triples (MAD)

source: By definition, the geomedian smooths variations in the satellite data to pick the most central, representative value. Outlying extreme highs and lows are generally filtered out by the robustness of the geomedian calculation. However, it is still useful to know about the variation within the dataset. This results in a set of second-order statistics: the Median Absolute Deviations (MADs).
fr: Par définition, le géomédian lisse les variations des données satellitaires pour choisir la valeur la plus centrale et la plus représentative. La robustesse du calcul géomédian permet généralement de filtrer les valeurs extrêmes extrêmes hautes et basses. Cependant, il est toujours utile de connaître la variation au sein de l'ensemble de données. Cela se traduit par un ensemble de statistiques de second ordre : les écarts absolus médians (MAD).

source: MADs are change statistics based on the geomedian. They show how much variation each pixel underwent in the given timeframe.
fr: Les MAD sont des statistiques de changement basées sur le géomédian. Elles montrent l'ampleur des variations subies par chaque pixel dans le laps de temps donné.

source: Let us break down the acronym “MAD”; as in the title, it stands for *median absolute deviation*:
fr: Décomposons l'acronyme "MAD" ; comme dans le titre, il signifie *déviation absolue médiane* :

source: This implies we have a collection of measurements
fr: Cela implique que nous avons une collection de mesures

source: We then find the deviation of each measurement from a baseline value, obtaining one deviation for every measurement
fr: Nous trouvons ensuite la déviation de chaque mesure par rapport à une valeur de base, en obtenant une déviation pour chaque mesure

source: These deviations are all absolute values, so each deviation is equal to or greater than 0
fr: Ces écarts sont tous des valeurs absolues, de sorte que chaque écart est égal ou supérieur à 0.

source: We then find the median, or middle value, of these deviations
fr: Nous trouvons ensuite la médiane, ou valeur moyenne, de ces écarts

source: This gives us a median absolute deviation
fr: Cela nous donne un écart absolu médian

source: In this case, our “collection of measurements” is satellite data from each flyover. Even for a single pixel, we have multiple measurements in the time axis: one from every pass.
fr: Dans ce cas, notre "collection de mesures" est constituée de données satellitaires provenant de chaque survol. Même pour un seul pixel, nous disposons de plusieurs mesures sur l'axe temporel : une pour chaque passage.

source: The “baseline value” is the annual geomedian, which provides one multispectral result for each pixel.
fr: La "valeur de référence" est le géomédian annuel, qui fournit un résultat multispectral pour chaque pixel.

source: The “deviations” here are three different *distance* or *dissimilarity* values. There are multiple ways of quantifying how change has occurred, so this product computes three different MADs for use in data analysis. We are calculating, in three separate ways, the deviation between the annual geomedian and a single flyover’s measurement. These three values have been chosen to reflect a range of changes that appear in Earth observation data, and hence this section of the dataset is often referred to as “triple MADs”.
fr: Les "écarts" sont ici trois valeurs différentes de *distance* ou de *dissimilarité*. Il existe de multiples façons de quantifier la façon dont le changement s'est produit, c'est pourquoi ce produit calcule trois MAD différentes à utiliser dans l'analyse des données. Nous calculons, de trois manières distinctes, l'écart entre la géomédiane annuelle et la mesure d'un seul survol. Ces trois valeurs ont été choisies pour refléter une gamme de changements qui apparaissent dans les données d'observation de la Terre, et c'est pourquoi cette section du jeu de données est souvent appelée "triple MAD".

source: The three MADs used in DE Africa are:
fr: Les trois MAD utilisés en Afrique DE sont :

source: Euclidean MAD, EMAD (based on Euclidean distance)
fr: MAD euclidienne, EMAD (basée sur la distance euclidienne)

source: Spectral MAD, SMAD (based on cosine distance)
fr: MAD spectrale, SMAD (basée sur la distance cosinus)

source: Bray-Curtis MAD, BCMAD (based on Bray-Curtis dissimilarity)
fr: MAD de Bray-Curtis, BCMAD (basé sur la dissimilarité de Bray-Curtis)

source: Each will be explained in their own sections below. Example calculations with real numbers are in the appendix.
fr: Chacun d'entre eux sera expliqué dans sa propre section ci-dessous. Des exemples de calculs avec des nombres réels se trouvent en annexe.

source: Note there are many other types of statistical distances and dissimilarities that can be used for median absolute deviation analysis (for example: Manhattan distance, Canberra distance, `there are many <https://ricottalab.files.wordpress.com/2015/05/ricotta-podani-2017-ecocom-full.pdf>`__ and they can all be used to calculate a MAD). However, in DE Africa services, the terms “triple MADs” or “MADs” are always specifically referring to the three MADs included in the GeoMAD dataset: EMAD, SMAD, and BCMAD.
fr: Notez qu'il existe de nombreux autres types de distances et de dissimilarités statistiques qui peuvent être utilisés pour l'analyse de l'écart absolu médian (par exemple : Distance de Manhattan, distance de Canberra, `il y en a beaucoup <https://ricottalab.files.wordpress.com/2015/05/ricotta-podani-2017-ecocom-full.pdf>`__ et elles peuvent toutes être utilisées pour calculer un MAD). Cependant, dans les services de DE Africa, les termes "triple MAD" ou "MAD" font toujours spécifiquement référence aux trois MAD inclus dans le jeu de données GeoMAD : EMAD, SMAD, et BCMAD.

source: Euclidean MAD (EMAD)
fr: MAD euclidien (EMAD)

source: The most logical place to start thinking about any of the MADs is the Euclidean MAD (EMAD). This is because EMAD comes from Euclidean distance, and Euclidean distance can be explained with a physical analogy: it is how we measure straight-line distances between points. In our three-dimensional world, it may look like this:
fr: L'endroit le plus logique pour commencer à réfléchir à l'une des MAD est la MAD euclidienne (EMAD). En effet, l'EMAD provient de la distance euclidienne, et la distance euclidienne peut être expliquée par une analogie physique : c'est la façon dont nous mesurons les distances en ligne droite entre des points. Dans notre monde tridimensionnel, cela peut ressembler à ceci :

source: **Figure 4: Euclidean distance in three dimensions.**
fr: **Figure 4 : Distance euclidienne en trois dimensions.**

source: In the case of satellite data, we are measuring the Euclidean distance between a pixel’s geomedian value and a single multispectral measurement. The number of dimensions is equal to the number of bands in the data. In the illustration below, :math:`m` is the geomedian value and :math:`\mathbf{x}` the measured value. In real data, there will be multiple measurements over a time period, so :math:`t` is the timestep number, otherwise noted in equations as superscript :math:`(t)`.
fr: Dans le cas des données satellitaires, nous mesurons la distance euclidienne entre la valeur géomédiane d'un pixel et une seule mesure multispectrale. Le nombre de dimensions est égal au nombre de bandes dans les données. Dans l'illustration ci-dessous, :math:`m` est la valeur géomédienne et :math:`\mathbf{x}` la valeur mesurée. Dans les données réelles, il y aura plusieurs mesures sur une période de temps, donc :math:`t` est le nombre de pas de temps, autrement noté dans les équations en exposant :math:`(t)`.

source: For example, if we had three bands of data (red, green and blue), and three timesteps of data, then we can calculate the Euclidean distances as follows:
fr: Par exemple, si nous disposons de trois bandes de données (rouge, vert et bleu) et de trois pas de temps de données, nous pouvons calculer les distances euclidiennes comme suit :

source: **Figure 5: Euclidean distance in three dimensions over three timesteps.**
fr: **Figure 5 : Distance euclidienne en trois dimensions sur trois pas de temps.**

source: Each timestep gives a separate Euclidean distance result. Then EMAD is the median of all those distances.
fr: Chaque pas de temps donne un résultat séparé de distance euclidienne. Ensuite, EMAD est la médiane de toutes ces distances.

source: In most real life conditions, there will be more than three timesteps and more than three bands. A general expression of Euclidean distance for :math:`p` bands is given as:
fr: Dans la plupart des conditions réelles, il y aura plus de trois pas de temps et plus de trois bandes. Une expression générale de la distance euclidienne pour les bandes :math:`p` est donnée comme suit :

source: :nbsphinx-math:`\begin{align*} &\text{Multispectral Euclidean distance for timestep }t \\ =& \sqrt{ \left( x^{(t)}_{\text{band 1}} - m_{\text{band 1}} \right)^2 + \left( x^{(t)}_{\text{band 2}} - m_{\text{band 2}} \right)^2 + \dots + \left( x^{(t)}_{\text{band p}} - m_{\text{band p}} \right)^2 }\\ =& \lVert \mathbf{x}^{(t)} - m \rVert_{\mathbb{R}^p} \end{align*}`
fr: :nbsphinx-math:``begin{align*} &\text{Distance euclidienne multispectrale pour le pas de temps }t \\\\\ =& \sqrt{ \left( x^{(t)}_{{text{band 1}} - m_{\text{\bande 1}} \right)^2 + \left( x^{(t)}_{{\text{\band{ 2}}) - m_{\text{\}{\i1}bande 2}} \right)^2 + \dots + \left( x^{(t)}_{\text{band p}} - m_{\text{\c} p}} \right)^2 }\\\N =& \lVert \mathbf{x}^{(t)} - m \rVert_{\mathbb{R}^p} \end{align*}`

source: Then EMAD for :math:`N` timesteps is given by `Roberts et al, 2018 <https://ieeexplore.ieee.org/abstract/document/8518312>`__, as the median of the Euclidean distances from all the timesteps.
fr: Ensuite, EMAD pour :math:`N` pas de temps est donné par `Roberts et al, 2018 <https://ieeexplore.ieee.org/abstract/document/8518312>`__, comme la médiane des distances euclidiennes de tous les pas de temps.

source: :nbsphinx-math:`\begin{align*} \text{EMAD} = \text{median} \left( \left\{ \lVert \mathbf{x}^{(t)} - \mathbf{m} \rVert_{\mathbb{R}^p}, t = 1, \dots , N \right\} \right) \end{align*}`
fr: :nbsphinx-math:``begin{align*} \text{EMAD} = \text{median} \left( \lVert \mathbf{x}^{(t)} - \mathbf{m} \rVert_{\mathbb{R}^p}, t = 1, \dots , N \right\} \right) \end{align*}`

source: In GeoMAD, the MADs are calculated from the same ten bands used in the geomedian, therefore :math:`p=10`. The result of :math:`\lVert \mathbf{x}^{(t)} - \mathbf{m} \rVert_{\mathbb{R}^p}` is a positive scalar, so :math:`\text{EMAD}_\text{GeoMAD}` is a positive scalar number. As in the geomedian, :math:`N` is dependent on the number of satellite flyovers particular to that pixel.
fr: Dans GeoMAD, les MAD sont calculés à partir des mêmes dix bandes utilisées dans la géomédienne, donc :math:`p=10`. Le résultat de :math:`\lVert \mathbf{x}^{(t)} - \mathbf{m} \rVert_{\mathbb{R}^p}` est un scalaire positif, donc :math:`\text{EMAD}_\text{GeoMAD}` est un nombre scalaire positif. Comme pour le géomédian, :math:`N` dépend du nombre de survols de satellites particuliers à ce pixel.

source: :nbsphinx-math:`\begin{align*} \text{EMAD}_\text{GeoMAD} = \text{median} \left( \left\{ \lVert \mathbf{x}^{(t)} - \mathbf{m} \rVert_{\mathbb{R}^{10}}, t = 1, \dots , N \right\} \right) \end{align*}`
fr: :nbsphinx-math:``begin{align*} \text{EMAD}_\text{GeoMAD} = \text{median} \left( \lVert \mathbf{x}^{(t)} - \mathbf{m} \rVert_{\mathbb{R}^{10}}, t = 1, \dots , N \right\} \right) \end{align*}`

source: The maximum possible value for EMAD depends on the value ranges for each of the bands in the dataset. In the case of GeoMAD, which uses annual timescales of ten bands of Sentinel-2 data, valid EMAD values range from ``0 - 31623``.
fr: La valeur maximale possible pour EMAD dépend des plages de valeurs pour chacune des bandes de l'ensemble de données. Dans le cas de GeoMAD, qui utilise les échelles temporelles annuelles de dix bandes de données Sentinel-2, les valeurs EMAD valides vont de "0 à 31623".

source: EMAD is useful for showing albedo shifts in satellite spectra.
fr: EMAD est utile pour montrer les changements d'albédo dans les spectres des satellites.

source: Spectral MAD (SMAD)
fr: MAD spectrale (SMAD)

source: The spectral MAD (SMAD) is based on the median absolute deviations in the cosine distance between the geomedian and individual measurements.
fr: La MAD spectrale (SMAD) est basée sur les écarts absolus médians de la distance en cosinus entre les mesures géomédiatiques et individuelles.

source: In two dimensions, cosine distance can be graphically compared to Euclidean distance by the following figure:
fr: En deux dimensions, la distance cosinus peut être comparée graphiquement à la distance euclidienne par la figure suivante :

source: **Figure 6: Relative relationships between Euclidean and cosine distances.**
fr: **Figure 6 : Relations relatives entre les distances euclidiennes et cosinusiennes.**

source: In a general sense, cosine distance is related to the angle between the two points :math:`\theta`, while Euclidean distance is related to the straight-line distance between the two points :math:`d`. Like Euclidean distance, points are more similar when the cosine distance between them is small. The value of the cosine distance is smaller when :math:`\theta` is small (i.e. close to 0) or when :math:`\theta` is close to 180\ :math:`^{\circ}`.
fr: D'une manière générale, la distance cosinus est liée à l'angle entre deux points :math:`\theta`, tandis que la distance euclidienne est liée à la distance en ligne droite entre les deux points :math:`d`. Comme pour la distance euclidienne, les points sont plus similaires lorsque la distance en cosinus entre eux est faible. La valeur de la distance en cosinus est plus petite lorsque :math:``theta` est petit (c'est-à-dire proche de 0) ou lorsque :math:``theta` est proche de 180\:math:`^{\circ}`.
