Repository: digitalearthafrica/deafrica-docs
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr

source: Spatial and temporal coverage
fr: Couverture spatiale et temporelle

source: DE Africa provides Landsat Collection 2 Level-2 from Landsat 5, 7 and 8 as seperate products. Relevant coverage and metadata can be viewed on DE Africa Metadata Exploer:
fr: DE Africa fournit la collection Landsat 2 Niveau 2 de Landsat 5, 7 et 8 comme produits séparés. La couverture et les métadonnées pertinentes peuvent être consultées sur DE Africa Metadata Exploer :

source: **Table 1: Landsat Collection 2 Level-2 Surface Reflectance product specifications**
fr: **Tableau 1 : Spécifications du produit de réflectance de surface de niveau 2 de la collection Landsat**.

source: Multispectral Scanner (MSS), Thematic Mapper (TM)
fr: Scanner multispectral (MSS), Mapper thématique (TM)

source: Enhanced Thematic Mapper (ETM+)
fr: Cartographie thématique améliorée (ETM+)

source: Operational Land Imager (OLI), Thermal Infrared Sensor (TIRS)
fr: Imageur terrestre opérationnel (OLI), Capteur infrarouge thermique (TIRS)

source: Universal Transverse Mercator (UTM)
fr: Mercator transverse universel (UTM)

source: Every 16 days
fr: Tous les 16 jours

source: 1999 – present
fr: 1999 - aujourd'hui

source: 2013 – present
fr: 2013 - aujourd'hui

source: NA (archive)
fr: NA (archives)

source: Daily
fr: Quotidiennement

source: Measurements
fr: Mesures

source: **Table 2: Landsat 5 and Landsat 7 Level-2 Surface Reflectance measurements**
fr: **Tableau 2 : Mesures de la réflectance de surface de niveau 2 de Landsat 5 et Landsat 7**.

source: Units
fr: Unités

source: Range
fr: Gamme

source: Conversion\ :math:`^\ddagger`
fr: Conversion\ :math:`^^dagger``

source: Surface reflectance band 1 (Blue)
fr: Bande de réflectance de surface 1 (bleu)

source: Unitless
fr: Sans unité

source: Surface reflectance band 2 (Green)
fr: Bande de réflectance de surface 2 (vert)

source: Surface reflectance band 3 (Red)
fr: Bande de réflectance de surface 3 (rouge)

source: Surface reflectance band 4 (Near-Infrared (NIR))
fr: Réflectance de la surface bande 4 (proche infrarouge (NIR))

source: Surface reflectance band 5 (Short Wavelength Infrared (SWIR) 1)
fr: Réflexion de la surface bande 5 (infrarouge à courte longueur d'onde (SWIR) 1)

source: Surface reflectance band 7 (SWIR 2)
fr: Réflexion de surface bande 7 (SWIR 2)

source: Pixel quality
fr: Qualité des pixels

source: Bit Index
fr: Index des bits

source: Radiometric saturation
fr: Saturation radiométrique

source: SR_ATMOS \_OPACITY
fr: SR_ATMOS \_OPACITÉ

source: Atmospheric opacity
fr: Opacité atmosphérique

source: Cloud mask quality
fr: Qualité du masque de nuage

source: :math:`^\ddagger` Physical measurement can be derived from the Digital Number (DN) stored in the product using the conversion equation listed.
fr: :math:`^\ddagger` La mesure physique peut être dérivée du numéro numérique (DN) stocké dans le produit en utilisant l'équation de conversion indiquée.

source: More inforamtion can be found from the `Landsat 4-7 Collection 2 Science Product Guide <https://www.usgs.gov/media/files/landsat-4-7-collection-2-level-2-science-product-guide>`__.
fr: Vous trouverez de plus amples informations dans le `Landsat 4-7 Collection 2 Science Product Guide <https://www.usgs.gov/media/files/landsat-4-7-collection-2-level-2-science-product-guide>`__.

source: **Table 3: Landsat 8 Level-2 Surface Reflectance measurements**
fr: **Tableau 3 : Mesures de la réflectance de surface Landsat 8 Niveau 2**.

source: Landsat 8 Level-2 science product is generated using a different algorithm and has different output measurements compared to Landsat 5 and Landsat 7.
fr: Le produit scientifique de niveau 2 de Landsat 8 est généré à l'aide d'un algorithme différent et présente des mesures de sortie différentes de celles de Landsat 5 et Landsat 7.

source: Surface reflectance band 1 (Coastal Aerosol)
fr: Bande de réflectance de surface 1 (aérosol côtier)

source: Surface reflectance band 2 (Blue)
fr: Bande de réflectance de surface 2 (bleu)

source: Surface reflectance band 3 (Green)
fr: Bande de réflectance de surface 3 (verte)

source: Surface reflectance band 4 (Red)
fr: Bande de réflectance de surface 4 (rouge)

source: Surface reflectance band 5 (NIR)
fr: Réflectance de surface bande 5 (NIR)

source: Surface reflectance band 6 (SWIR 1)
fr: Bande de réflectance de surface 6 (SWIR 1)

source: Aerosol level
fr: Niveau de l'aérosol

source: More inforamtion can be found from `Landsat 8 OLI/TIRS Collection 2 Science Product Guide <https://www.usgs.gov/media/files/landsat-8-collection-2-level-2-science-product-guide>`__ and `Landsat 8-9 OLI/TIRS Collection 2 Level 2 Data Format Control Book <https://www.usgs.gov/media/files/landsat-8-9-olitirs-collection-2-level-2-data-format-control-book>`__
fr: De plus amples informations peuvent être trouvées dans le `Landsat 8 OLI/TIRS Collection 2 Science Product Guide <https://www.usgs.gov/media/files/landsat-8-collection-2-level-2-science-product-guide>`__ et le `Landsat 8-9 OLI/TIRS Collection 2 Level 2 Data Format Control Book <https://www.usgs.gov/media/files/landsat-8-9-olitirs-collection-2-level-2-data-format-control-book>`__.

source: Quality assessment bands
fr: Bandes d'évaluation de la qualité

source: Pixel quality assessment (QA_PIXEL) bands for Landsat 5, 7 and 8 are generated by the CFMask algorithm. Different bit definitions are used because the cirrus band is only available on Landsat 8. This band is relevant to both Surface Reflectance and Surface Temperature products.
fr: Les bandes d'évaluation de la qualité des pixels (QA_PIXEL) pour Landsat 5, 7 et 8 sont générées par l'algorithme CFMask. Des définitions de bits différentes sont utilisées car la bande cirrus n'est disponible que sur Landsat 8. Cette bande est pertinente pour les produits Réflectance de surface et Température de surface.

source: **Table 4: Pixel quality assessment (QA_PIXEL) bit index.**
fr: **Tableau 4 : Indice binaire de l'évaluation de la qualité des pixels (QA_PIXEL).**

source: Landat 5 & 7
fr: Landat 5 et 7

source: Description Values
fr: Valeurs de description

source: Fill
fr: Remplir

source: 0 for image data; 1 for fill data
fr: 0 pour les données d'image ; 1 pour les données de remplissage

source: Dilated Cloud
fr: Nuage dilaté

source: 0 for cloud is not dilated or no cloud; 1 for cloud dilation
fr: 0 pour le nuage n'est pas dilaté ou pas de nuage ; 1 pour la dilatation du nuage

source: Unused
fr: Non utilisé

source: 0 for cirrus confidence is not; 1 for high confidence cirrus
fr: 0 pour les cirrus dont la confiance est nulle ; 1 pour les cirrus de haute confiance

source: Cloud
fr: Nuage

source: 0 for cloud confidence is not high; 1 for high confidence cloud
fr: 0 pour un nuage dont la confiance n'est pas élevée ; 1 pour un nuage dont la confiance est élevée.

source: Cloud Shadow
fr: Ombre des nuages

source: 0 for Cloud Shadow Confidence is not high; 1 for high confidence cloud shadow
fr: 0 pour une ombre nuageuse dont la confiance n'est pas élevée ; 1 pour une ombre nuageuse dont la confiance est élevée.

source: Snow
fr: Neige

source: 0 for Snow/Ice Confidence is not high; 1 for high confidence snow cover
fr: 0 pour une couverture neigeuse/glace dont la confiance n'est pas élevée ; 1 pour une couverture neigeuse dont la confiance est élevée

source: Clear
fr: Clair

source: 0 if Cloud or Dilated Cloud bits are set; 1 if Cloud and Dilated Cloud bits are not set
fr: 0 si les bits de nuage ou de nuage dilaté sont activés ; 1 si les bits de nuage et de nuage dilaté ne sont pas activés.

source: Water
fr: Eau

source: 0 for land or cloud; 1 for water
fr: 0 pour la terre ou les nuages ; 1 pour l'eau

source: Cloud Confidence
fr: Confiance dans les nuages

source: 00 for no confidence level set; 01 Low confidence; 10 Medium confidence; 11 High confidence
fr: 00 pour aucun niveau de confiance défini ; 01 Faible confiance ; 10 Confiance moyenne ; 11 Confiance élevée

source: Cloud Shadow Confidence
fr: Confiance dans l'ombre des nuages

source: 00 for no confidence level set; 01 Low confidence; 10 Reserved; 11 High confidence
fr: 00 pour aucun niveau de confiance défini ; 01 Faible confiance ; 10 Réservé ; 11 Haute confiance

source: Snow/Ice Confidence
fr: Confiance en la neige/la glace

source: Radiometric saturation quality assessment (QA_RADSAT) bands are different for Landsat 5, 7 and 8 because the sensors have different spectral bands. This band is relevant to both Surface Reflectance and Surface Temperature products.
fr: Les bandes d'évaluation de la qualité de la saturation radiométrique (QA_RADSAT) sont différentes pour Landsat 5, 7 et 8 car les capteurs ont des bandes spectrales différentes. Cette bande est pertinente pour les produits Réflectance de surface et Température de surface.

source: **Table 5: Radiometric saturation quality assessment (QA_RADSAT) bit index.**
fr: **Tableau 5 : Indice binaire de l'évaluation de la qualité de la saturation radiométrique (QA_RADSAT).**

source: Band 1 (Blue)
fr: Bande 1 (bleu)

source: Band 1 (Coastal)
fr: Bande 1 (côtière)

source: 0 no saturation; 1 saturated data
fr: 0 pas de saturation ; 1 données saturées

source: Band 2 (Green)
fr: Bande 2 (verte)

source: Band 2 (Blue)
fr: Band 2 (Bleu)

source: Band 3 (Red)
fr: Band 3 (Rouge)

source: Band 3 (Green)
fr: Bande 3 (verte)

source: Band 4 (NIR)
fr: Bande 4 (NIR)

source: Band 4 (Red)
fr: Band 4 (Rouge)

source: Band 5 (SWIR1)
fr: Bande 5 (SWIR1)

source: Band 5 (NIR)
fr: Bande 5 (NIR)

source: Band 6 (TIR)
fr: Bande 6 (TIR)

source: Band 6L (TIR)†
fr: Bande 6L (TIR)†

source: Band 6 (SWIR1)
fr: Bande 6 (SWIR1)

source: Band 7 (SWIR2)
fr: Bande 7 (SWIR2)

source: Band 6H (TIR)‡
fr: Bande 6H (TIR)‡

source: Band 9 (Cirrus)
fr: Bande 9 (Cirrus)

source: Dropped Pixel
fr: Pixel perdu

source: 0 Pixel present; 1 detector doesn’t have a value – no data
fr: 0 Pixel présent ; 1 détecteur n'a pas de valeur - pas de données

source: Terrain occlusion
fr: Occlusion de terrain

source: 0 no terrain occlusion; 1 terrain occlusion
fr: 0 aucune occlusion de terrain ; 1 occlusion de terrain

source: :math:`^\dagger`, :math:`^\ddagger` For Landsat 7 products, the Band 6 TOA brightness temperature product is generated from ETM+ Band 6 High gain (6H) and Band 6 Low gain (6L) merged together. The merged Band 6 is comprised of pixels that are not saturated in Band 6H. When Band 6H pixels are saturated with a brightness temperature outside of the 6H dynamic range (from 240K to 322K), they will be filled with pixels from the 6L band even if those pixels are saturated.
fr: :math:`^\dagger`, :math:`^\ddagger` Pour les produits Landsat 7, le produit de température de brillance TOA de la bande 6 est généré à partir de la bande 6 High gain (6H) et de la bande 6 Low gain (6L) ETM+ fusionnées ensemble. La bande 6 fusionnée est composée de pixels qui ne sont pas saturés dans la bande 6H. Lorsque les pixels de la bande 6H sont saturés avec une température de luminosité en dehors de la plage dynamique de la bande 6H (de 240K à 322K), ils seront remplis de pixels de la bande 6L même si ces pixels sont saturés.

source: For Landsat 5 and 7, another cloud mask band (SR_CLOUD_QA) is available but is less accurate than the QA_PIXEL band.
fr: Pour Landsat 5 et 7, une autre bande de masque de nuage (SR_CLOUD_QA) est disponible mais elle est moins précise que la bande QA_PIXEL.

source: **Table 6: Landsat 5 and Landsat 7 cloud mask (SR_CLOUD_QA) bit index.**
fr: **Tableau 6 : Index des bits des masques de nuages Landsat 5 et Landsat 7 (SR_CLOUD_QA).**

source: Attribute
fr: Attribut

source: Dark Dense Vegetation (DDV)
fr: Végétation dense et sombre (VDS)

source: Cloud shadow
fr: Ombre des nuages

source: Adjacent to cloud
fr: Adjacent au nuage

source: For Landsat 8, aeresol retrieval information that may have impacted the product is provided in a SR_Aerosol_QA band. The default “Aerosol Level” is Climatology (00), which means no aerosol correction was applied. Pixels with an “Aerosol Level” classified as high are not recommended for use.
fr: Pour Landsat 8, les informations de récupération des aérosols qui ont pu avoir un impact sur le produit sont fournies dans une bande SR_Aerosol_QA. Le "Niveau d'aérosol" par défaut est Climatologie (00), ce qui signifie qu'aucune correction d'aérosol n'a été appliquée. Il n'est pas recommandé d'utiliser des pixels dont le "niveau d'aérosol" est élevé.

source: **Table 7: Landsat 8 aerosol level (SR_Aerosol_QA) bit index.**
fr: **Tableau 7 : Niveau d'aérosol de Landsat 8 (SR_Aerosol_QA) indice binaire**.

source: Flag
fr: Drapeau

source: 0 Pixel is not fill; 1 Pixel is fill
fr: 0 Le pixel n'est pas rempli ; 1 Le pixel est rempli.

source: Valid aerosol retrieval
fr: Récupération valide des aérosols

source: 0 Pixel retrieval is not valid; 1 Pixel retrieval is valid
fr: 0 La récupération des pixels n'est pas valide ; 1 La récupération des pixels est valide.

source: 0 Pixel is not water; 1 Pixel is water
fr: 0 Pixel n'est pas de l'eau ; 1 Pixel est de l'eau

source: Interpolated Aerosol
fr: Aérosol interpolé

source: 0 Pixel is not aerosol interpolated; 1 Pixel is aerosol interpolated
fr: 0 Le pixel n'est pas interpolé par les aérosols ; 1 Le pixel est interpolé par les aérosols.

source: Aerosol Level
fr: Niveau de l'aérosol

source: 00 Climatology; 01 Low; 10 Medium; 11 High
fr: 00 Climatologie ; 01 Bas ; 10 Moyen ; 11 Haut

source: Landsat Collection 2 Level-2 products are processed by the USGS from Collection 2 Level-1 inputs. Landsat 8 OLI surface reflectance products are generated using the Land Surface Reflectance Code (LaSRC) algorithm. Landsat 4-5 TM and Landsat 7 ETM+ surface reflectance products are generated using the Landsat Ecosystem Disturbance Adaptive Processing System (LEDAPS) algorithm.
fr: Les produits Landsat Collection 2 Level-2 sont traités par l'USGS à partir des entrées Collection 2 Level-1. Les produits de réflectance de surface Landsat 8 OLI sont générés à l'aide de l'algorithme LaSRC (Land Surface Reflectance Code). Les produits de réflectance de surface Landsat 4-5 TM et Landsat 7 ETM+ sont générés à l'aide de l'algorithme LEDAPS (Landsat Ecosystem Disturbance Adaptive Processing System).

source: **Figure 1: Landsat false color composites (highlighting vegetation) over an area in Tripoli District, Libya, showing changes between selected dates from 1984 to 2021.**
fr: **Figure 1 : Composites fausses couleurs Landsat (mettant en évidence la végétation) sur une zone du district de Tripoli, Libye, montrant les changements entre les dates sélectionnées de 1984 à 2021**.

source: `Water Observations from Space <https://docs.digitalearthafrica.org/en/latest/data_specs/WOfS_specs.html>`__
fr: ``Observations de l'eau depuis l'espace <https://docs.digitalearthafrica.org/en/latest/data_specs/WOfS_specs.html>`___

source: `USGS Collection Level-2 website <https://www.usgs.gov/core-science-systems/nli/landsat/landsat-collection-2>`__
fr: `Site web de la collection de l'USGS niveau 2 <https://www.usgs.gov/core-science-systems/nli/landsat/landsat-collection-2>`__

source: There are no restrictions on Landsat data downloaded from the USGS; it can be used or redistributed as desired. USGS request that you include a `statement of the data source <https://www.usgs.gov/centers/eros/data-citation?qt-science_support_page_related_con=0#qt-science_support_page_related_con>`__ when citing, copying, or reprinting USGS Landsat data or images.
fr: Il n'existe aucune restriction sur les données Landsat téléchargées depuis l'USGS ; elles peuvent être utilisées ou redistribuées à volonté. L'USGS vous demande d'inclure une "déclaration de la source des données <https://www.usgs.gov/centers/eros/data-citation?qt-science_support_page_related_con=0#qt-science_support_page_related_con>`__" lorsque vous citez, copiez ou réimprimez des données ou des images Landsat de l'USGS.

source: Landsat Level- 2 Surface Reflectance Science Product courtesy of the U.S. Geological Survey.
fr: Produit scientifique de la réflectance de surface Landsat Level- 2, gracieuseté de l'U.S. Geological Survey.

source: Landsat Collection 2 Level-2 is available in AWS S3 thanks to the Public Dataset Program.
fr: Landsat Collection 2 Level-2 est disponible dans AWS S3 grâce au programme de données publiques.

source: **Table 8: AWS data access details.**
fr: **Tableau 8 : Détails de l'accès aux données AWS.**

source: The file paths follow the format ``collection02/level-2/standard/<sensor>/<year>/<path>/<row>/<scene_id>/``.
fr: Les chemins d'accès aux fichiers suivent le format "collection02/niveau-2/standard/<sensor>/<year>/<path>/<row>/<scene_id>/``.

source: **Table 9: AWS file path convention.**
fr: **Tableau 9 : Convention de chemin d'accès aux fichiers AWS.**

source: ``sensor``
fr: ``capteur``

source: Landsat sensor name, ``tm``, ``etm`` or ``oli-tirs`` for landsat 5, 7 and 8
fr: Nom du capteur Landsat, ``tm``, ``etm`` ou ``oli-tirs`` pour landsat 5, 7 et 8

source: ``path``
fr: ``chemin``

source: Landsat orbit path id
fr: Identifiant de la trajectoire de l'orbite Landsat

source: Landsat orbit row id
fr: Identité de la ligne d'orbite Landsat

source: Landsat scene id
fr: Identifiant de la scène Landsat

source: **Table 10: OWS data access details.**
fr: **Tableau 10 : Détails de l'accès aux données OWS.**

source: **ODC product names:** ``ls5_sr``, ``ls7_sr``, ``ls8_sr``
fr: Noms de produits **ODC:** ``ls5_sr``, ``ls7_sr``, ``ls8_sr``

source: **Table 11: Landsat 5 and Landsat 7 Level-2 Surface Reflectance (ODC product ls5_sr and ls7_sr) band names.**
fr: **Tableau 11 : noms des bandes de réflectance de surface de niveau 2 de Landsat 5 et Landsat 7 (produit ODC ls5_sr et ls7_sr).

source: band_1, blue
fr: bande_1, bleu

source: band_2, green
fr: bande_2, vert

source: band_3, red
fr: bande_3, rouge

source: band_5, swir_1
fr: bande_5, tourbillon_1

source: band_7, swir_2
fr: bande_7, tourbillon_2

source: pq, pixel_quality
fr: pq, qualité_pixel

source: radsat, radiometric_saturation
fr: radsat, saturation radiométrique

source: SR_ATMOS_OPACITY
fr: SR_ATMOS_OPACITÉ

source: atmos_opacity
fr: opacité_atmos

source: cloud_qa
fr: nuage_qa

source: **Table 12: Landsat 8 Level-2 Surface Reflectance (ODC product ls8_sr) band names.**
fr: **Tableau 12 : Nom des bandes de la réflectance de surface Landsat 8 Level-2 (produit ODC ls8_sr).

source: band_1, coastal_aerosol
fr: bande_1, aérosol_côtier

source: band_2, blue
fr: bande_2, bleu

source: band_3, green
fr: bande_3, vert

source: band_4, red
fr: bande_4, rouge

source: band_6, swir_1
fr: bande_6, tourbillon_1

source: The surface reflectance products for Landat 5, 7 and 8 are generated using two different methods.
fr: Les produits de réflectance de surface pour Landat 5, 7 et 8 sont générés en utilisant deux méthodes différentes.

source: Landsat 5 TM and Landsat 7 ETM+ Collection 2 Surface Reflectance are generated using the Landsat Ecosystem Disturbance Adaptive Processing System (LEDAPS) algorithm. The software applies Moderate Resolution Imaging Spectroradiometer (MODIS) atmospheric correction routines to Level-1 data products. Water vapor, ozone, atmospheric height, aerosol optical thickness, and digital elevation are input with Landsat data to the Second Simulation of a Satellite Signal in the Solar Spectrum (6S) radiative transfer models to generate top of atmosphere (TOA) reflectance, surface reflectance, TOA brightness temperature, and masks for clouds, cloud shadows, adjacent clouds, land, and water.
fr: La réflectance de surface de Landsat 5 TM et Landsat 7 ETM+ Collection 2 est générée à l'aide de l'algorithme LEDAPS (Landsat Ecosystem Disturbance Adaptive Processing System). Le logiciel applique les routines de correction atmosphérique du spectroradiomètre imageur à résolution modérée (MODIS) aux produits de données de niveau 1. La vapeur d'eau, l'ozone, la hauteur atmosphérique, l'épaisseur optique des aérosols et l'élévation numérique sont introduits avec les données Landsat dans les modèles de transfert radiatif 6S (Second Simulation of a Satellite Signal in the Solar Spectrum) pour générer la réflectance au sommet de l'atmosphère (TOA), la réflectance de surface, la température de brillance TOA et les masques pour les nuages, les ombres de nuages, les nuages adjacents, la terre et l'eau.

source: Landsat 8 OLI Collection 2 Surface Reflectance data are generated using the Land Surface Reflectance Code (LaSRC), which makes use of the coastal aerosol band to perform aerosol inversion tests, uses auxiliary climate data from MODIS, and a unique radiative transfer model.
fr: Les données de réflectance de surface de la collection 2 de Landsat 8 OLI sont générées à l'aide du Land Surface Reflectance Code (LaSRC), qui utilise la bande d'aérosol côtière pour effectuer des tests d'inversion d'aérosol, utilise des données climatiques auxiliaires de MODIS et un modèle de transfert radiatif unique.

source: For more information on the different processing algorithms and caveats of the products, visit the `Landsat Collection 2 Surface Reflectance webpage <https://www.usgs.gov/core-science-systems/nli/landsat/landsat-collection-2-surface-reflectance>`__.
fr: Pour plus d'informations sur les différents algorithmes de traitement et les mises en garde relatives aux produits, visitez la page web `Landsat Collection 2 Surface Reflectance <https://www.usgs.gov/core-science-systems/nli/landsat/landsat-collection-2-surface-reflectance>`__.

source: Landsat Collection 2 Level-2 Surface Temperature
fr: Température de surface du niveau 2 de la collection Landsat

source: This document provides technical specifications for the Surface Temperature product. Information for the Surface Refletance product can be found in the `Landsat Collection 2 Level-2 Surface Reflectance specification <https://docs.digitalearthafrica.org/en/latest/data_specs/Landsat_C2_SR_specs.html>`__.
fr: Ce document fournit des spécifications techniques pour le produit Température de surface. Les informations relatives au produit Réflectance de surface se trouvent dans la `Spécification de la réflectance de surface de niveau 2 de la collection 2 de Landsat <https://docs.digitalearthafrica.org/en/latest/data_specs/Landsat_C2_SR_specs.html>`__.

source: Surface temperature measures the Earth’s surface temperature and is an important geophysical parameter in global energy balance studies and hydrologic modeling. Surface temperature is also useful for monitoring crop and vegetation health, and extreme heat events such as natural disasters (e.g., volcanic eruptions, wildfires), and urban heat island effects.
fr: La température de surface mesure la température de la surface de la Terre et constitue un paramètre géophysique important dans les études du bilan énergétique global et la modélisation hydrologique. La température de surface est également utile pour surveiller la santé des cultures et de la végétation, ainsi que les événements de chaleur extrême tels que les catastrophes naturelles (par exemple, les éruptions volcaniques, les incendies de forêt) et les effets des îlots de chaleur urbains.

source: `Landsat 5 Collection 2 Level-2 Surface Temperature <https://explorer.digitalearth.africa/products/ls5_st>`__
fr: `Landsat 5 Collection 2 Niveau-2 Température de surface <https://explorer.digitalearth.africa/products/ls5_st>`__

source: `Landsat 7 Collection 2 Level-2 Surface Temperature <https://explorer.digitalearth.africa/products/ls7_st>`__
fr: `Landsat 7 Collection 2 Niveau-2 Température de surface <https://explorer.digitalearth.africa/products/ls7_st>`__

source: `Landsat 8 Collection 2 Level-2 Surface Temperature <https://explorer.digitalearth.africa/products/ls8_st>`__
fr: `Landsat 8 Collection 2 Niveau-2 Température de surface <https://explorer.digitalearth.africa/products/ls8_st>`__
