Repository: digitalearthafrica/deafrica-docs
Catalog: locales/*/LC_MESSAGES/docs.po
Languages: fr

source: ``month``
fr: ``mois``

source: Month of the year the data was collected (with leading zeros)
fr: Mois de l'année où les données ont été collectées (avec des zéros en tête)

source: ``day``
fr: ``jour``

source: Day of the month the data was collected (with leading zeros)
fr: Jour du mois où les données ont été collectées (avec des zéros en tête)

source: Layer names
fr: Noms des couches

source: The WOfS suite of datasets can be accessed through the Digital Earth Africa ODC API, which is available through the `Digital Earth Africa Sandbox <https://sandbox.digitalearth.africa/hub/login>`__.
fr: La suite de jeux de données WOfS est accessible par l'API ODC de Digital Earth Africa, qui est disponible dans le `Digital Earth Africa Sandbox <https://sandbox.digitalearth.africa/hub/login>`__.

source: **ODC product name:** ``ga_ls8c_wofs_2``, ``ga_ls8c_wofs_2_annual_summary``, ``ga_ls8c_wofs_2_summary``
fr: **Nom de produit ODC:** ``ga_ls8c_wofs_2``, ``ga_ls8c_wofs_2_annual_summary``, ``ga_ls8c_wofs_2_summary``.

source: **Table 11: WOFL ODC band names**
fr: **Tableau 11 : noms des groupes de WOFL ODC**.

source: The Annual Summary and the All-Time Summary have the same band names in the ODC.
fr: Le résumé annuel et le résumé de tous les temps ont les mêmes noms de bande dans l'ODC.

source: **Table 12: WOfS Annual/All-Time Summary ODC band names**
fr: **Tableau 12 : Noms des bandes de l'ODC du WOfS Annual/All-Time Summary**.

source: wet
fr: humide

source: clear
fr: clair

source: Algorithm
fr: Algorithme

source: The Water Observations from Space Detection Algorithm uses a decision tree method using both spectral band measurements and derived indices as input datasets. It also utilised several ancillary datasets, including slope.
fr: L'algorithme de détection des observations de l'eau depuis l'espace utilise une méthode d'arbre de décision utilisant à la fois les mesures de la bande spectrale et les indices dérivés comme ensembles de données d'entrée. Il utilise également plusieurs ensembles de données auxiliaires, dont la pente.

source: An illustration of the decision tree is shown in Figure 2.
fr: Une illustration de l'arbre de décision est présentée à la figure 2.

source: **Figure 2: WOfS Detection Algorithm decision tree. Tree branches are shown in green with endpoint for water and not-water displayed as blue and red respectively. Each branch indicates the variable used to split and the resulting balance of water and not-water samples created by the split. Source:** `Mueller, 2016 <https://doi.org/10.1016/j.rse.2015.11.003>`__
fr: **Figure 2 : Arbre de décision de l'algorithme de détection WOfS. Les branches de l'arbre sont représentées en vert avec les extrémités pour l'eau et la non-eau affichées en bleu et rouge respectivement. Chaque branche indique la variable utilisée pour la division et l'équilibre résultant des échantillons d'eau et de non-eau créés par la division. Source:** `Mueller, 2016 <https://doi.org/10.1016/j.rse.2015.11.003>`__

source: Validation method
fr: Méthode de validation

source: The Digital Earth Africa validation task team has many years’ of combined experience validating satellite-derived maps in different regions of Africa, and a long history of collaborating with a wide variety of stakeholders.
fr: L'équipe de validation de Digital Earth Africa a une expérience combinée de plusieurs années de validation de cartes satellitaires dans différentes régions d'Afrique, et une longue histoire de collaboration avec une grande variété de parties prenantes.

source: To validate WOfS data, the continent was divided into seven Agro-Ecological Zones (AEZ). Analysts from within each regional geospatial organization labelled a large set of sample points using image interpretation of satellite and aerial imagery. Analysts applied their regional and local knowledge to help define class labels and interpret any difficult features, creating a validation dataset that is both accurate and fit for purpose. To ensure WOfS is as accurate as possible, it was validated against a range of data points. 2900 sample points were generated, covering the African continent, including the main islands.
fr: Pour valider les données WOfS, le continent a été divisé en sept zones agro-écologiques (AEZ). Des analystes de chaque organisation géospatiale régionale ont étiqueté un large ensemble de points d'échantillonnage en utilisant l'interprétation d'images satellites et aériennes. Les analystes ont appliqué leurs connaissances régionales et locales pour aider à définir les étiquettes de classe et à interpréter toute caractéristique difficile, créant ainsi un ensemble de données de validation qui est à la fois précis et adapté à l'objectif. Pour s'assurer que WOfS est aussi précis que possible, il a été validé par rapport à une série de points de données. 2900 points d'échantillonnage ont été générés, couvrant le continent africain, y compris les principales îles.

source: Typically, water classifiers are adept at mapping large, open water bodies — so for this exercise, water features with an area of more than 100 square kilometres were masked out. This ensured that analysis remained focused on areas that are more challenging to map, such as small water bodies with different colours, depths and surrounding environments.
fr: En général, les classificateurs d'eau sont capables de cartographier de grands plans d'eau ouverts. Pour cet exercice, les éléments d'eau d'une superficie de plus de 100 kilomètres carrés ont donc été masqués. L'analyse est ainsi restée concentrée sur les zones plus difficiles à cartographier, telles que les petits plans d'eau de couleurs, de profondeurs et de milieux environnants différents.

source: Stratified random sampling was then performed to select locations with different water occurrences and waterbody types. By focusing the sample on the more difficult-to-map areas, this sample scheme allowed the Digital Earth Africa team to understand the limitations of WOfS, and meant that WOfS could be compared to other available datasets. It also resulted in overall accuracy for this exercise appearing lower than expected, since the ‘easy to map’ areas had been removed from the sample design.
fr: Un échantillonnage aléatoire stratifié a ensuite été effectué afin de sélectionner des lieux présentant des occurrences d'eau et des types de plans d'eau différents. En concentrant l'échantillon sur les zones les plus difficiles à cartographier, ce plan d'échantillonnage a permis à l'équipe de Digital Earth Africa de comprendre les limites de WOfS et de comparer WOfS à d'autres ensembles de données disponibles. Il a également eu pour conséquence que la précision globale de cet exercice est apparue plus faible que prévu, puisque les zones "faciles à cartographier" avaient été retirées du plan d'échantillonnage.

source: Next, analysts labelled each sample point using a visual interpretation of sample points provided by online tool, Collect Earth Online (CEO). CEO allowed multiple analysts to assess points as water or non-water using satellite and aerial images. The labelled sample points were then compared with the WOfS map, determining where the WOfS map service agrees — or disagrees — with the validation dataset.
fr: Ensuite, les analystes ont étiqueté chaque point d'échantillonnage en utilisant une interprétation visuelle des points d'échantillonnage fournie par l'outil en ligne Collect Earth Online (CEO). CEO permet à plusieurs analystes d'évaluer les points comme étant de l'eau ou non à l'aide d'images satellites et aériennes. Les points d'échantillonnage étiquetés ont ensuite été comparés à la carte WOfS, afin de déterminer où le service cartographique WOfS est en accord - ou en désaccord - avec l'ensemble de données de validation.

source: The sampling design is independent of the WOfS classification, so this validation dataset can be used to provide quantitive comparisons with products such as future versions of WOfS, or other existing surface water maps.
fr: Le plan d'échantillonnage est indépendant de la classification WOfS, de sorte que cet ensemble de données de validation peut être utilisé pour fournir des comparaisons quantitatives avec des produits tels que les futures versions de WOfS, ou d'autres cartes des eaux de surface existantes.

source: Validation results
fr: Résultats de la validation

source: At a continental-scale, WOfS is able to accurately identify about 80% of the labelled water features (Figure 3). 94% of its water classifications are correct (Figure 4, left).
fr: À l'échelle continentale, WOfS est capable d'identifier avec précision environ 80 % des éléments d'eau étiquetés (figure 3). 94% de ses classifications d'eau sont correctes (Figure 4, gauche).

source: At the AEZ level, WOfS performs outstandingly in Eastern, Sahel and Northern AEZs with more than 85% of reference water features in these zones being correctly identified as water (Figure 4, right). The reliability of this classification in the Eastern zone is also very high at more than 96%; and the WOfS classification in all seven AEZ proved to be reliable, with more than 84% user accuracy (Figure 4, left). The Western AEZ is a challenging zone with high cloud coverage and a wet climate, 71.3% of reference water features have been correctly identified as water in WOfS product, and 97.4% of these water features are actually water.
fr: Au niveau des ZEA, la classification WOfS est très performante dans les ZEA de l'Est, du Sahel et du Nord, avec plus de 85% des caractéristiques de référence de l'eau dans ces zones correctement identifiées comme de l'eau (Figure 4, droite). La fiabilité de cette classification dans la zone orientale est également très élevée, à plus de 96% ; et la classification WOfS dans les sept ZEA s'est avérée fiable, avec une précision de plus de 84% pour l'utilisateur (Figure 4, gauche). L'AEZ de l'Ouest est une zone difficile avec une couverture nuageuse élevée et un climat humide, 71,3 % des éléments d'eau de référence ont été correctement identifiés comme de l'eau dans le produit WOfS, et 97,4 % de ces éléments d'eau sont réellement de l'eau.

source: **Figure 3: Overall WOfS accuracy, split by Agro-Ecological Zone.**
fr: **Figure 3 : Précision globale du WOfS, répartie par zone agro-écologique.

source: **Figure 4: WOfS user’s accuracy (left) and producer’s accuracy (right), split by Agro-Ecological Zone.**
fr: **Figure 4 : Précision de l'utilisateur du WOfS (à gauche) et précision du producteur (à droite), répartis par zone agro-écologique.

source: Limitations and caveats
fr: Limites et mises en garde

source: During the WOfS validation assessment, a number of issues associated with input data, validation method and the WOfS algorithm were detected. The validation results should be interpreted with the following caveats:
fr: Au cours de l'évaluation de la validation du WOfS, un certain nombre de problèmes associés aux données d'entrée, à la méthode de validation et à l'algorithme du WOfS ont été détectés. Les résultats de la validation doivent être interprétés avec les mises en garde suivantes :

source: **Spatial resolution:** The WOfS product is based on 30 m resolution Landsat imagery while the validation data is produced using 10 m resolution Sentinel-2 imagery. WOfS has trouble in areas with mixed pixels (where a pixel covers both water and upland). These areas tend to be on edges of lakes and in wetlands where there is a mix of water and vegetation. The Sentinel-2 imagery can identify these edges at a higher resolution than the current Landsat WOfS product.
fr: **Résolution spatiale:** Le produit WOfS est basé sur une imagerie Landsat de 30 m de résolution alors que les données de validation sont produites à partir d'une imagerie Sentinel-2 de 10 m de résolution. WOfS a des difficultés dans les zones avec des pixels mixtes (où un pixel couvre à la fois l'eau et la terre ferme). Ces zones se situent généralement au bord des lacs et dans les zones humides où il y a un mélange d'eau et de végétation. L'imagerie Sentinel-2 peut identifier ces bords à une résolution plus élevée que le produit WOfS actuel de Landsat.

source: **WOfS algorithm:** A few examples highlight how WOfS misses certain water bodies. This information is critical to improving the WOfS algorithm in future iterations. In some cases, the impact can be mitigated by using a temporal summary of WOfS. A waterbody may be missed in one date of WOfS, but over the course of the year it is mapped as water in other dates and therefore mapped as a waterbody in the annual summary.
fr: **Algorithme WOfS:** Quelques exemples mettent en évidence la façon dont le WOfS rate certaines masses d'eau. Cette information est essentielle pour améliorer l'algorithme WOfS dans les itérations futures. Dans certains cas, l'impact peut être atténué en utilisant un résumé temporel du WOfS. Une masse d'eau peut être manquée à une date du WOfS, mais au cours de l'année, elle est cartographiée comme eau à d'autres dates et donc cartographiée comme masse d'eau dans le résumé annuel.

source: **Environmental factors:** There are some errors that are hard to correct for. Sediment, floating vegetation etc. are potentially contributing factors in this type of error by changing the colour of water and making detection hard.
fr: **Facteurs environnementaux:** Certaines erreurs sont difficiles à corriger. Les sédiments, la végétation flottante, etc. sont des facteurs qui peuvent contribuer à ce type d'erreur en modifiant la couleur de l'eau et en rendant la détection difficile.

source: **Temporal resolution:** Reference locations may have been observed on different dates by the Sentinel-2 and the Landsat satellites. If the water extent has changed between the dates, a mismatch in the classification is expected.
fr: **Résolution temporelle : ** Les lieux de référence peuvent avoir été observés à des dates différentes par les satellites Sentinel-2 et Landsat. Si l'étendue de l'eau a changé entre les deux dates, on peut s'attendre à un décalage dans la classification.

source: Sentinel-1 SAR Backscatter
fr: Rétrodiffusion SAR de Sentinel-1

source: This dataset is expected to become available to Digital Earth Africa users in the second quarter of 2021.
fr: Ce jeu de données devrait être mis à la disposition des utilisateurs de Digital Earth Africa au cours du deuxième trimestre de 2021.

source: The `Sentinel-1 mission <https://sentinel.esa.int/web/sentinel/missions/sentinel-1>`__, composed of a constellation of two C-band Synthetic Aperture Radar (SAR) satellites, are operated by European Space Agency (ESA) as part of the Copernicus Programme. The mission currently collects data every 12 days over Africa at a spatial resolution of approximately 20 m.
fr: La mission `Sentinel-1 <https://sentinel.esa.int/web/sentinel/missions/sentinel-1>`__, composée d'une constellation de deux satellites radar à ouverture synthétique (SAR) en bande C, est exploitée par l'Agence spatiale européenne (ESA) dans le cadre du programme Copernicus. La mission collecte actuellement des données tous les 12 jours au-dessus de l'Afrique avec une résolution spatiale d'environ 20 m.

source: Radar backscatter measures the amount of microwave radiation reflected back to the sensor from the ground surface. This measurement is sensitive to surface roughness, moisture content and viewing geometry. DE Africa provides Sentinel-1 backscatter as Radiometrically Terrain Corrected (RTC) gamma-0 (γ0) where variation due to changing observation geometries has been mitigated.
fr: La rétrodiffusion radar mesure la quantité de rayonnement micro-ondes réfléchi vers le capteur par la surface du sol. Cette mesure est sensible à la rugosité de la surface, à la teneur en humidité et à la géométrie de visée. DE Africa fournit la rétrodiffusion de Sentinel-1 sous forme de gamma-0 (γ0) radiométriquement corrigé du terrain (RTC), où la variation due aux changements de géométrie d'observation a été atténuée.

source: The dual polarisation backcastter time series can be used in applications for forests, agriculture, wetlands and land cover classification. SAR’s ability to ‘see through’ clouds makes it critical for mapping and monitoring land cover changes in the wet tropics.
fr: Les séries chronologiques du rétrodiffuseur à double polarisation peuvent être utilisées dans des applications pour les forêts, l'agriculture, les zones humides et la classification de la couverture terrestre. La capacité du SAR à "voir à travers" les nuages le rend essentiel pour la cartographie et le suivi des changements de la couverture terrestre dans les zones tropicales humides.

source: DE Africa’s Sentinel-1 backscatter product is developed to be compliant with the `CEOS Analysis Ready Data for Land (CARD4L) <https://ceos.org/ard/>`__ specifications.
fr: Le produit de rétrodiffusion Sentinel-1 de DE Africa est développé pour être conforme aux spécifications `CEOS Analysis Ready Data for Land (CARD4L) <https://ceos.org/ard/>`__.

source: Coverage and metadata for the Sentinel-1 backscatter can be viewed on DE Africa’s `Metadata Explorer <https://explorer.digitalearth.africa/products/s1_rtc>`__.
fr: La couverture et les métadonnées de la rétrodiffusion de Sentinel-1 peuvent être consultées sur le site `Metadata Explorer <https://explorer.digitalearth.africa/products/s1_rtc>`__ de DE Africa.

source: **Table 1: Sentinel-1 product specifications**
fr: **Tableau 1 : Spécifications du produit Sentinel-1**.

source: Sentinel-1 Radiometric Terrain Corrected SAR Backscatter
fr: Rétrodiffusion SAR Sentinel-1 corrigée en fonction du terrain radiométrique

source: C-band (5.405 GHz)
fr: Bande C (5,405 GHz)

source: Acquisition mode
fr: Mode d'acquisition

source: Interferometric Wide swath (IW)
fr: Interférométrique à large bande (IW)

source: Every 12 days
fr: Tous les 12 jours

source: 2017-01-01 – present
fr: 2017-01-01 - aujourd'hui

source: **Table 2: Sentinel-1 measurements**
fr: **Tableau 2 : Mesures de Sentinel-1**.

source: Linear backscatter intensity in VV polarization
fr: Intensité de rétrodiffusion linéaire en polarisation VV

source: Linear backscatter intensity in VH polarization
fr: Intensité de rétrodiffusion linéaire en polarisation VH

source: Data mask
fr: Masque de données

source: area
fr: zone

source: Normalized scattering area
fr: Zone de diffusion normalisée

source: Local incidence angle (degree)
fr: Angle d'incidence locale (degré)

source: **Table 3: Sentinel-1 data mask definition**
fr: **Tableau 3 : Définition du masque de données Sentinel-1**.

source: Valid
fr: Valable

source: Invalid (in/near radar shadow)
fr: Invalide (dans/près de l'ombre du radar)

source: DE Africa Sentinel-1 dataset is processed by Sinergise Sentinel Hub using ESA `Sentinel-1 GRD <https://registry.opendata.aws/sentinel-1/>`__ as input. Radiometric terrain correction is applied using `Copernicus DEM <https://registry.opendata.aws/copernicus-dem/>`__, following method developed in `D. Small 2011 <https://doi.org/10.1109/TGRS.2011.2120616>`__.
fr: Le jeu de données DE Africa Sentinel-1 est traité par Sinergise Sentinel Hub en utilisant le `Sentinel-1 GRD <https://registry.opendata.aws/sentinel-1/>`__ de l'ESA comme entrée. La correction radiométrique du terrain est appliquée en utilisant le `Copernicus DEM <https://registry.opendata.aws/copernicus-dem/>`__, suivant la méthode développée dans `D. Small 2011 <https://doi.org/10.1109/TGRS.2011.2120616>`__.

source: **Figure 1: Sentinel-1 false color composite over an area in Okavango Delta, Botswana.**
fr: **Figure 1 : Composite fausses couleurs de Sentinel-1 sur une zone du delta de l'Okavango, Botswana.

source: Small, “Flattening Gamma: Radiometric Terrain Correction for SAR Imagery,” in IEEE Transactions on Geoscience and Remote Sensing, vol. 49, no. 8, pp. 3081-3093, Aug. 2011, doi: 10.1109/TGRS.2011.2120616.
fr: Small, " Flattening Gamma : Radiometric Terrain Correction for SAR Imagery ", dans IEEE Transactions on Geoscience and Remote Sensing, vol. 49, no. 8, pp. 3081-3093, Aug. 2011, doi : 10.1109/TGRS.2011.2120616.

source: Access to Sentinel data is free, full and open for the broad Regional, National, European and International user community. View `Terms and Conditions <https://scihub.copernicus.eu/twiki/do/view/SciHubWebPortal/TermsConditions>`__.
fr: L'accès aux données Sentinel est gratuit, complet et ouvert pour la vaste communauté des utilisateurs régionaux, nationaux, européens et internationaux. Voir `Termes et conditions <https://scihub.copernicus.eu/twiki/do/view/SciHubWebPortal/TermsConditions>`__.

source: DE Africa Sentinel-1 dataset is available in AWS S3, sponsored by the Public Dataset Program.
fr: Le jeu de données DE Africa Sentinel-1 est disponible sur AWS S3, sponsorisé par le programme de données publiques.

source: **Table 4: AWS data access details.**
fr: **Tableau 4 : Détails de l'accès aux données AWS.**
